IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TPCC0_TPCC0.xml
<module name="TPCC0_TPCC0" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="TPCC0_PID" acronym="TPCC0_PID" offset="0x0" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID Scheme:  Used to distinguish between old ID scheme and  current. Spare bit to encode future schemes EDMA uses 'new  scheme' indicated with value of 0x1." range="31 - 30" rwaccess="RO"/> 
		<bitfield id="RES1" width="2" begin="29" end="28" resetval="0x0" description="RESERVE FIELD" range="29 - 28" rwaccess="RO"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1" description="Function indicates a software compatible module family." range="27 - 16" rwaccess="RO"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x21" description="RTL Version" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x3" description="Major Revision" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom revision field:  Not used on this version of EDMA." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x0" description="Minor Revision" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_CCCFG" acronym="TPCC0_CCCFG" offset="0x4" width="32" description="">
		<bitfield id="RES2" width="6" begin="31" end="26" resetval="0x0" description="RESERVE FIELD" range="31 - 26" rwaccess="RO"/> 
		<bitfield id="MPEXIST" width="1" begin="25" end="25" resetval="0x0" description="Memory Protection Existence MPEXIST = 0 : No memory  protection. MPEXIST = 1 : Memory Protection logic included." range="25" rwaccess="RO"/> 
		<bitfield id="CHMAPEXIST" width="1" begin="24" end="24" resetval="0x0" description="Channel Mapping Existence CHMAPEXIST = 0 : No Channel  mapping. CHMAPEXIST = 1 : Channel mapping logic included." range="24" rwaccess="RO"/> 
		<bitfield id="RES3" width="2" begin="23" end="22" resetval="0x0" description="RESERVE FIELD" range="23 - 22" rwaccess="RO"/> 
		<bitfield id="NUMREGN" width="2" begin="21" end="20" resetval="0x2" description="Number of MP and Shadow regions" range="21 - 20" rwaccess="RO"/> 
		<bitfield id="RES4" width="1" begin="19" end="19" resetval="0x0" description="RESERVE FIELD" range="19" rwaccess="RO"/> 
		<bitfield id="NUMTC" width="3" begin="18" end="16" resetval="0x1" description="Number of Queues/Number of TCs" range="18 - 16" rwaccess="RO"/> 
		<bitfield id="RES5" width="1" begin="15" end="15" resetval="0x0" description="RESERVE FIELD" range="15" rwaccess="RO"/> 
		<bitfield id="NUMPAENTRY" width="3" begin="14" end="12" resetval="0x3" description="Number of PaRAM entries" range="14 - 12" rwaccess="RO"/> 
		<bitfield id="RES6" width="1" begin="11" end="11" resetval="0x0" description="RESERVE FIELD" range="11" rwaccess="RO"/> 
		<bitfield id="NUMINTCH" width="3" begin="10" end="8" resetval="0x4" description="Number of Interrupt Channels" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="RES7" width="1" begin="7" end="7" resetval="0x0" description="RESERVE FIELD" range="7" rwaccess="RO"/> 
		<bitfield id="NUMQDMACH" width="3" begin="6" end="4" resetval="0x4" description="Number of QDMA Channels" range="6 - 4" rwaccess="RO"/> 
		<bitfield id="RES8" width="1" begin="3" end="3" resetval="0x0" description="RESERVE FIELD" range="3" rwaccess="RO"/> 
		<bitfield id="NUMDMACH" width="3" begin="2" end="0" resetval="0x5" description="Number of DMA Channels" range="2 - 0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QCHMAPN" acronym="TPCC0_QCHMAPN" offset="0x200" width="32" description="">
		<bitfield id="RES10" width="18" begin="31" end="14" resetval="0x0" description="RESERVE FIELD" range="31 - 14" rwaccess="RO"/> 
		<bitfield id="PAENTRY" width="9" begin="13" end="5" resetval="0x0" description="PaRAM Entry number for QDMA Channel N." range="13 - 5" rwaccess="RW"/> 
		<bitfield id="TRWORD" width="3" begin="4" end="2" resetval="0x0" description="TRWORD points to the specific trigger word of the PaRAM  Entry defined by PAENTRY. A write to the trigger word  results in a QDMA Event being recognized." range="4 - 2" rwaccess="RW"/>
	</register>
	<register id="TPCC0_DMAQNUMN" acronym="TPCC0_DMAQNUMN" offset="0x240" width="32" description="">
		<bitfield id="RES11" width="1" begin="31" end="31" resetval="0x0" description="RESERVE FIELD" range="31" rwaccess="RO"/> 
		<bitfield id="E7" width="3" begin="30" end="28" resetval="0x0" description="DMA Queue Number for event #7" range="30 - 28" rwaccess="RW"/> 
		<bitfield id="RES12" width="1" begin="27" end="27" resetval="0x0" description="RESERVE FIELD" range="27" rwaccess="RO"/> 
		<bitfield id="E6" width="3" begin="26" end="24" resetval="0x0" description="DMA Queue Number for event #6" range="26 - 24" rwaccess="RW"/> 
		<bitfield id="RES13" width="1" begin="23" end="23" resetval="0x0" description="RESERVE FIELD" range="23" rwaccess="RO"/> 
		<bitfield id="E5" width="3" begin="22" end="20" resetval="0x0" description="DMA Queue Number for event #5" range="22 - 20" rwaccess="RW"/> 
		<bitfield id="RES14" width="1" begin="19" end="19" resetval="0x0" description="RESERVE FIELD" range="19" rwaccess="RO"/> 
		<bitfield id="E4" width="3" begin="18" end="16" resetval="0x0" description="DMA Queue Number for event #4" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="RES15" width="1" begin="15" end="15" resetval="0x0" description="RESERVE FIELD" range="15" rwaccess="RO"/> 
		<bitfield id="E3" width="3" begin="14" end="12" resetval="0x0" description="DMA Queue Number for event #3" range="14 - 12" rwaccess="RW"/> 
		<bitfield id="RES16" width="1" begin="11" end="11" resetval="0x0" description="RESERVE FIELD" range="11" rwaccess="RO"/> 
		<bitfield id="E2" width="3" begin="10" end="8" resetval="0x0" description="DMA Queue Number for event #2" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="RES17" width="1" begin="7" end="7" resetval="0x0" description="RESERVE FIELD" range="7" rwaccess="RO"/> 
		<bitfield id="E1" width="3" begin="6" end="4" resetval="0x0" description="DMA Queue Number for event #1" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="RES18" width="1" begin="3" end="3" resetval="0x0" description="RESERVE FIELD" range="3" rwaccess="RO"/> 
		<bitfield id="E0" width="3" begin="2" end="0" resetval="0x0" description="DMA Queue Number for event #0" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TPCC0_QDMAQNUM" acronym="TPCC0_QDMAQNUM" offset="0x260" width="32" description="">
		<bitfield id="RES19" width="1" begin="31" end="31" resetval="0x0" description="RESERVE FIELD" range="31" rwaccess="RO"/> 
		<bitfield id="E7" width="3" begin="30" end="28" resetval="0x0" description="QDMA Queue Number for event #7" range="30 - 28" rwaccess="RW"/> 
		<bitfield id="RES20" width="1" begin="27" end="27" resetval="0x0" description="RESERVE FIELD" range="27" rwaccess="RO"/> 
		<bitfield id="E6" width="3" begin="26" end="24" resetval="0x0" description="QDMA Queue Number for event #6" range="26 - 24" rwaccess="RW"/> 
		<bitfield id="RES21" width="1" begin="23" end="23" resetval="0x0" description="RESERVE FIELD" range="23" rwaccess="RO"/> 
		<bitfield id="E5" width="3" begin="22" end="20" resetval="0x0" description="QDMA Queue Number for event #5" range="22 - 20" rwaccess="RW"/> 
		<bitfield id="RES22" width="1" begin="19" end="19" resetval="0x0" description="RESERVE FIELD" range="19" rwaccess="RO"/> 
		<bitfield id="E4" width="3" begin="18" end="16" resetval="0x0" description="QDMA Queue Number for event #4" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="RES23" width="1" begin="15" end="15" resetval="0x0" description="RESERVE FIELD" range="15" rwaccess="RO"/> 
		<bitfield id="E3" width="3" begin="14" end="12" resetval="0x0" description="QDMA Queue Number for event #3" range="14 - 12" rwaccess="RW"/> 
		<bitfield id="RES24" width="1" begin="11" end="11" resetval="0x0" description="RESERVE FIELD" range="11" rwaccess="RO"/> 
		<bitfield id="E2" width="3" begin="10" end="8" resetval="0x0" description="QDMA Queue Number for event #2" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="RES25" width="1" begin="7" end="7" resetval="0x0" description="RESERVE FIELD" range="7" rwaccess="RO"/> 
		<bitfield id="E1" width="3" begin="6" end="4" resetval="0x0" description="QDMA Queue Number for event #1" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="RES26" width="1" begin="3" end="3" resetval="0x0" description="RESERVE FIELD" range="3" rwaccess="RO"/> 
		<bitfield id="E0" width="3" begin="2" end="0" resetval="0x0" description="QDMA Queue Number for event #0" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TPCC0_QUETCMAP" acronym="TPCC0_QUETCMAP" offset="0x280" width="32" description="">
		<bitfield id="RES27" width="25" begin="31" end="7" resetval="0x0" description="RESERVE FIELD" range="31 - 7" rwaccess="RO"/> 
		<bitfield id="TCNUMQ1" width="3" begin="6" end="4" resetval="0x1" description="TC Number for Queue N: Defines the TC number that Event  Queue N TRs are written to." range="6 - 4" rwaccess="RW"/> 
		<bitfield id="RES28" width="1" begin="3" end="3" resetval="0x0" description="RESERVE FIELD" range="3" rwaccess="RO"/> 
		<bitfield id="TCNUMQ0" width="3" begin="2" end="0" resetval="0x0" description="TC Number for Queue N: Defines the TC number that Event  Queue N TRs are written to." range="2 - 0" rwaccess="RW"/>
	</register>
