IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TPCC0_TPCC0.xml
	<register id="TPCC0_QUEPRI" acronym="TPCC0_QUEPRI" offset="0x284" width="32" description="">
		<bitfield id="RES29" width="25" begin="31" end="7" resetval="0x0" description="RESERVE FIELD" range="31 - 7" rwaccess="RO"/> 
		<bitfield id="PRIQ1" width="3" begin="6" end="4" resetval="0x0" description="Priority Level for Queue 1 Dictates the priority level used  for the OPTIONS field programmation for Qn TRs. Sets the  priority used for TC read and write commands." range="6 - 4" rwaccess="RW"/> 
		<bitfield id="RES30" width="1" begin="3" end="3" resetval="0x0" description="RESERVE FIELD" range="3" rwaccess="RO"/> 
		<bitfield id="PRIQ0" width="3" begin="2" end="0" resetval="0x0" description="Priority Level for Queue 0 Dictates the priority level used  for the OPTIONS field programmation for Qn TRs. Sets the  priority used for TC read and write commands." range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TPCC0_EMR" acronym="TPCC0_EMR" offset="0x300" width="32" description="">
		<bitfield id="E31" width="1" begin="31" end="31" resetval="0x0" description="Event Missed #31" range="31" rwaccess="RO"/> 
		<bitfield id="E30" width="1" begin="30" end="30" resetval="0x0" description="Event Missed #30" range="30" rwaccess="RO"/> 
		<bitfield id="E29" width="1" begin="29" end="29" resetval="0x0" description="Event Missed #29" range="29" rwaccess="RO"/> 
		<bitfield id="E28" width="1" begin="28" end="28" resetval="0x0" description="Event Missed #28" range="28" rwaccess="RO"/> 
		<bitfield id="E27" width="1" begin="27" end="27" resetval="0x0" description="Event Missed #27" range="27" rwaccess="RO"/> 
		<bitfield id="E26" width="1" begin="26" end="26" resetval="0x0" description="Event Missed #26" range="26" rwaccess="RO"/> 
		<bitfield id="E25" width="1" begin="25" end="25" resetval="0x0" description="Event Missed #25" range="25" rwaccess="RO"/> 
		<bitfield id="E24" width="1" begin="24" end="24" resetval="0x0" description="Event Missed #24" range="24" rwaccess="RO"/> 
		<bitfield id="E23" width="1" begin="23" end="23" resetval="0x0" description="Event Missed #23" range="23" rwaccess="RO"/> 
		<bitfield id="E22" width="1" begin="22" end="22" resetval="0x0" description="Event Missed #22" range="22" rwaccess="RO"/> 
		<bitfield id="E21" width="1" begin="21" end="21" resetval="0x0" description="Event Missed #21" range="21" rwaccess="RO"/> 
		<bitfield id="E20" width="1" begin="20" end="20" resetval="0x0" description="Event Missed #20" range="20" rwaccess="RO"/> 
		<bitfield id="E19" width="1" begin="19" end="19" resetval="0x0" description="Event Missed #19" range="19" rwaccess="RO"/> 
		<bitfield id="E18" width="1" begin="18" end="18" resetval="0x0" description="Event Missed #18" range="18" rwaccess="RO"/> 
		<bitfield id="E17" width="1" begin="17" end="17" resetval="0x0" description="Event Missed #17" range="17" rwaccess="RO"/> 
		<bitfield id="E16" width="1" begin="16" end="16" resetval="0x0" description="Event Missed #16" range="16" rwaccess="RO"/> 
		<bitfield id="E15" width="1" begin="15" end="15" resetval="0x0" description="Event Missed #15" range="15" rwaccess="RO"/> 
		<bitfield id="E14" width="1" begin="14" end="14" resetval="0x0" description="Event Missed #14" range="14" rwaccess="RO"/> 
		<bitfield id="E13" width="1" begin="13" end="13" resetval="0x0" description="Event Missed #13" range="13" rwaccess="RO"/> 
		<bitfield id="E12" width="1" begin="12" end="12" resetval="0x0" description="Event Missed #12" range="12" rwaccess="RO"/> 
		<bitfield id="E11" width="1" begin="11" end="11" resetval="0x0" description="Event Missed #11" range="11" rwaccess="RO"/> 
		<bitfield id="E10" width="1" begin="10" end="10" resetval="0x0" description="Event Missed #10" range="10" rwaccess="RO"/> 
		<bitfield id="E9" width="1" begin="9" end="9" resetval="0x0" description="Event Missed #9" range="9" rwaccess="RO"/> 
		<bitfield id="E8" width="1" begin="8" end="8" resetval="0x0" description="Event Missed #8" range="8" rwaccess="RO"/> 
		<bitfield id="E7" width="1" begin="7" end="7" resetval="0x0" description="Event Missed #7" range="7" rwaccess="RO"/> 
		<bitfield id="E6" width="1" begin="6" end="6" resetval="0x0" description="Event Missed #6" range="6" rwaccess="RO"/> 
		<bitfield id="E5" width="1" begin="5" end="5" resetval="0x0" description="Event Missed #5" range="5" rwaccess="RO"/> 
		<bitfield id="E4" width="1" begin="4" end="4" resetval="0x0" description="Event Missed #4" range="4" rwaccess="RO"/> 
		<bitfield id="E3" width="1" begin="3" end="3" resetval="0x0" description="Event Missed #3" range="3" rwaccess="RO"/> 
		<bitfield id="E2" width="1" begin="2" end="2" resetval="0x0" description="Event Missed #2" range="2" rwaccess="RO"/> 
		<bitfield id="E1" width="1" begin="1" end="1" resetval="0x0" description="Event Missed #1" range="1" rwaccess="RO"/> 
		<bitfield id="E0" width="1" begin="0" end="0" resetval="0x0" description="Event Missed #0" range="0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_EMRH" acronym="TPCC0_EMRH" offset="0x304" width="32" description="">
		<bitfield id="E63" width="1" begin="31" end="31" resetval="0x0" description="Event Missed #63" range="31" rwaccess="RO"/> 
		<bitfield id="E62" width="1" begin="30" end="30" resetval="0x0" description="Event Missed #62" range="30" rwaccess="RO"/> 
		<bitfield id="E61" width="1" begin="29" end="29" resetval="0x0" description="Event Missed #61" range="29" rwaccess="RO"/> 
		<bitfield id="E60" width="1" begin="28" end="28" resetval="0x0" description="Event Missed #60" range="28" rwaccess="RO"/> 
		<bitfield id="E59" width="1" begin="27" end="27" resetval="0x0" description="Event Missed #59" range="27" rwaccess="RO"/> 
		<bitfield id="E58" width="1" begin="26" end="26" resetval="0x0" description="Event Missed #58" range="26" rwaccess="RO"/> 
		<bitfield id="E57" width="1" begin="25" end="25" resetval="0x0" description="Event Missed #57" range="25" rwaccess="RO"/> 
		<bitfield id="E56" width="1" begin="24" end="24" resetval="0x0" description="Event Missed #56" range="24" rwaccess="RO"/> 
		<bitfield id="E55" width="1" begin="23" end="23" resetval="0x0" description="Event Missed #55" range="23" rwaccess="RO"/> 
		<bitfield id="E54" width="1" begin="22" end="22" resetval="0x0" description="Event Missed #54" range="22" rwaccess="RO"/> 
		<bitfield id="E53" width="1" begin="21" end="21" resetval="0x0" description="Event Missed #53" range="21" rwaccess="RO"/> 
		<bitfield id="E52" width="1" begin="20" end="20" resetval="0x0" description="Event Missed #52" range="20" rwaccess="RO"/> 
		<bitfield id="E51" width="1" begin="19" end="19" resetval="0x0" description="Event Missed #51" range="19" rwaccess="RO"/> 
		<bitfield id="E50" width="1" begin="18" end="18" resetval="0x0" description="Event Missed #50" range="18" rwaccess="RO"/> 
		<bitfield id="E49" width="1" begin="17" end="17" resetval="0x0" description="Event Missed #49" range="17" rwaccess="RO"/> 
		<bitfield id="E48" width="1" begin="16" end="16" resetval="0x0" description="Event Missed #48" range="16" rwaccess="RO"/> 
		<bitfield id="E47" width="1" begin="15" end="15" resetval="0x0" description="Event Missed #47" range="15" rwaccess="RO"/> 
		<bitfield id="E46" width="1" begin="14" end="14" resetval="0x0" description="Event Missed #46" range="14" rwaccess="RO"/> 
		<bitfield id="E45" width="1" begin="13" end="13" resetval="0x0" description="Event Missed #45" range="13" rwaccess="RO"/> 
		<bitfield id="E44" width="1" begin="12" end="12" resetval="0x0" description="Event Missed #44" range="12" rwaccess="RO"/> 
		<bitfield id="E43" width="1" begin="11" end="11" resetval="0x0" description="Event Missed #43" range="11" rwaccess="RO"/> 
		<bitfield id="E42" width="1" begin="10" end="10" resetval="0x0" description="Event Missed #42" range="10" rwaccess="RO"/> 
		<bitfield id="E41" width="1" begin="9" end="9" resetval="0x0" description="Event Missed #41" range="9" rwaccess="RO"/> 
		<bitfield id="E40" width="1" begin="8" end="8" resetval="0x0" description="Event Missed #40" range="8" rwaccess="RO"/> 
		<bitfield id="E39" width="1" begin="7" end="7" resetval="0x0" description="Event Missed #39" range="7" rwaccess="RO"/> 
		<bitfield id="E38" width="1" begin="6" end="6" resetval="0x0" description="Event Missed #38" range="6" rwaccess="RO"/> 
		<bitfield id="E37" width="1" begin="5" end="5" resetval="0x0" description="Event Missed #37" range="5" rwaccess="RO"/> 
		<bitfield id="E36" width="1" begin="4" end="4" resetval="0x0" description="Event Missed #36" range="4" rwaccess="RO"/> 
		<bitfield id="E35" width="1" begin="3" end="3" resetval="0x0" description="Event Missed #35" range="3" rwaccess="RO"/> 
		<bitfield id="E34" width="1" begin="2" end="2" resetval="0x0" description="Event Missed #34" range="2" rwaccess="RO"/> 
		<bitfield id="E33" width="1" begin="1" end="1" resetval="0x0" description="Event Missed #33" range="1" rwaccess="RO"/> 
		<bitfield id="E32" width="1" begin="0" end="0" resetval="0x0" description="Event Missed #32" range="0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_EMCR" acronym="TPCC0_EMCR" offset="0x308" width="32" description="">
		<bitfield id="E31" width="1" begin="31" end="31" resetval="0x0" description="Event Missed Clear #31" range="31" rwaccess="WO"/> 
		<bitfield id="E30" width="1" begin="30" end="30" resetval="0x0" description="Event Missed Clear #30" range="30" rwaccess="WO"/> 
		<bitfield id="E29" width="1" begin="29" end="29" resetval="0x0" description="Event Missed Clear #29" range="29" rwaccess="WO"/> 
		<bitfield id="E28" width="1" begin="28" end="28" resetval="0x0" description="Event Missed Clear #28" range="28" rwaccess="WO"/> 
		<bitfield id="E27" width="1" begin="27" end="27" resetval="0x0" description="Event Missed Clear #27" range="27" rwaccess="WO"/> 
		<bitfield id="E26" width="1" begin="26" end="26" resetval="0x0" description="Event Missed Clear #26" range="26" rwaccess="WO"/> 
		<bitfield id="E25" width="1" begin="25" end="25" resetval="0x0" description="Event Missed Clear #25" range="25" rwaccess="WO"/> 
		<bitfield id="E24" width="1" begin="24" end="24" resetval="0x0" description="Event Missed Clear #24" range="24" rwaccess="WO"/> 
		<bitfield id="E23" width="1" begin="23" end="23" resetval="0x0" description="Event Missed Clear #23" range="23" rwaccess="WO"/> 
		<bitfield id="E22" width="1" begin="22" end="22" resetval="0x0" description="Event Missed Clear #22" range="22" rwaccess="WO"/> 
		<bitfield id="E21" width="1" begin="21" end="21" resetval="0x0" description="Event Missed Clear #21" range="21" rwaccess="WO"/> 
		<bitfield id="E20" width="1" begin="20" end="20" resetval="0x0" description="Event Missed Clear #20" range="20" rwaccess="WO"/> 
		<bitfield id="E19" width="1" begin="19" end="19" resetval="0x0" description="Event Missed Clear #19" range="19" rwaccess="WO"/> 
		<bitfield id="E18" width="1" begin="18" end="18" resetval="0x0" description="Event Missed Clear #18" range="18" rwaccess="WO"/> 
		<bitfield id="E17" width="1" begin="17" end="17" resetval="0x0" description="Event Missed Clear #17" range="17" rwaccess="WO"/> 
		<bitfield id="E16" width="1" begin="16" end="16" resetval="0x0" description="Event Missed Clear #16" range="16" rwaccess="WO"/> 
		<bitfield id="E15" width="1" begin="15" end="15" resetval="0x0" description="Event Missed Clear #15" range="15" rwaccess="WO"/> 
		<bitfield id="E14" width="1" begin="14" end="14" resetval="0x0" description="Event Missed Clear #14" range="14" rwaccess="WO"/> 
		<bitfield id="E13" width="1" begin="13" end="13" resetval="0x0" description="Event Missed Clear #13" range="13" rwaccess="WO"/> 
		<bitfield id="E12" width="1" begin="12" end="12" resetval="0x0" description="Event Missed Clear #12" range="12" rwaccess="WO"/> 
		<bitfield id="E11" width="1" begin="11" end="11" resetval="0x0" description="Event Missed Clear #11" range="11" rwaccess="WO"/> 
		<bitfield id="E10" width="1" begin="10" end="10" resetval="0x0" description="Event Missed Clear #10" range="10" rwaccess="WO"/> 
		<bitfield id="E9" width="1" begin="9" end="9" resetval="0x0" description="Event Missed Clear #9" range="9" rwaccess="WO"/> 
		<bitfield id="E8" width="1" begin="8" end="8" resetval="0x0" description="Event Missed Clear #8" range="8" rwaccess="WO"/> 
		<bitfield id="E7" width="1" begin="7" end="7" resetval="0x0" description="Event Missed Clear #7" range="7" rwaccess="WO"/> 
		<bitfield id="E6" width="1" begin="6" end="6" resetval="0x0" description="Event Missed Clear #6" range="6" rwaccess="WO"/> 
		<bitfield id="E5" width="1" begin="5" end="5" resetval="0x0" description="Event Missed Clear #5" range="5" rwaccess="WO"/> 
		<bitfield id="E4" width="1" begin="4" end="4" resetval="0x0" description="Event Missed Clear #4" range="4" rwaccess="WO"/> 
		<bitfield id="E3" width="1" begin="3" end="3" resetval="0x0" description="Event Missed Clear #3" range="3" rwaccess="WO"/> 
		<bitfield id="E2" width="1" begin="2" end="2" resetval="0x0" description="Event Missed Clear #2" range="2" rwaccess="WO"/> 
		<bitfield id="E1" width="1" begin="1" end="1" resetval="0x0" description="Event Missed Clear #1" range="1" rwaccess="WO"/> 
		<bitfield id="E0" width="1" begin="0" end="0" resetval="0x0" description="Event Missed Clear #0" range="0" rwaccess="WO"/>
	</register>
	<register id="TPCC0_EMCRH" acronym="TPCC0_EMCRH" offset="0x30C" width="32" description="">
		<bitfield id="E63" width="1" begin="31" end="31" resetval="0x0" description="Event Missed Clear #63" range="31" rwaccess="WO"/> 
		<bitfield id="E62" width="1" begin="30" end="30" resetval="0x0" description="Event Missed Clear #62" range="30" rwaccess="WO"/> 
		<bitfield id="E61" width="1" begin="29" end="29" resetval="0x0" description="Event Missed Clear #61" range="29" rwaccess="WO"/> 
		<bitfield id="E60" width="1" begin="28" end="28" resetval="0x0" description="Event Missed Clear #60" range="28" rwaccess="WO"/> 
		<bitfield id="E59" width="1" begin="27" end="27" resetval="0x0" description="Event Missed Clear #59" range="27" rwaccess="WO"/> 
		<bitfield id="E58" width="1" begin="26" end="26" resetval="0x0" description="Event Missed Clear #58" range="26" rwaccess="WO"/> 
		<bitfield id="E57" width="1" begin="25" end="25" resetval="0x0" description="Event Missed Clear #57" range="25" rwaccess="WO"/> 
		<bitfield id="E56" width="1" begin="24" end="24" resetval="0x0" description="Event Missed Clear #56" range="24" rwaccess="WO"/> 
		<bitfield id="E55" width="1" begin="23" end="23" resetval="0x0" description="Event Missed Clear #55" range="23" rwaccess="WO"/> 
		<bitfield id="E54" width="1" begin="22" end="22" resetval="0x0" description="Event Missed Clear #54" range="22" rwaccess="WO"/> 
		<bitfield id="E53" width="1" begin="21" end="21" resetval="0x0" description="Event Missed Clear #53" range="21" rwaccess="WO"/> 
		<bitfield id="E52" width="1" begin="20" end="20" resetval="0x0" description="Event Missed Clear #52" range="20" rwaccess="WO"/> 
		<bitfield id="E51" width="1" begin="19" end="19" resetval="0x0" description="Event Missed Clear #51" range="19" rwaccess="WO"/> 
		<bitfield id="E50" width="1" begin="18" end="18" resetval="0x0" description="Event Missed Clear #50" range="18" rwaccess="WO"/> 
		<bitfield id="E49" width="1" begin="17" end="17" resetval="0x0" description="Event Missed Clear #49" range="17" rwaccess="WO"/> 
		<bitfield id="E48" width="1" begin="16" end="16" resetval="0x0" description="Event Missed Clear #48" range="16" rwaccess="WO"/> 
		<bitfield id="E47" width="1" begin="15" end="15" resetval="0x0" description="Event Missed Clear #47" range="15" rwaccess="WO"/> 
		<bitfield id="E46" width="1" begin="14" end="14" resetval="0x0" description="Event Missed Clear #46" range="14" rwaccess="WO"/> 
		<bitfield id="E45" width="1" begin="13" end="13" resetval="0x0" description="Event Missed Clear #45" range="13" rwaccess="WO"/> 
		<bitfield id="E44" width="1" begin="12" end="12" resetval="0x0" description="Event Missed Clear #44" range="12" rwaccess="WO"/> 
		<bitfield id="E43" width="1" begin="11" end="11" resetval="0x0" description="Event Missed Clear #43" range="11" rwaccess="WO"/> 
		<bitfield id="E42" width="1" begin="10" end="10" resetval="0x0" description="Event Missed Clear #42" range="10" rwaccess="WO"/> 
		<bitfield id="E41" width="1" begin="9" end="9" resetval="0x0" description="Event Missed Clear #41" range="9" rwaccess="WO"/> 
		<bitfield id="E40" width="1" begin="8" end="8" resetval="0x0" description="Event Missed Clear #40" range="8" rwaccess="WO"/> 
		<bitfield id="E39" width="1" begin="7" end="7" resetval="0x0" description="Event Missed Clear #39" range="7" rwaccess="WO"/> 
		<bitfield id="E38" width="1" begin="6" end="6" resetval="0x0" description="Event Missed Clear #38" range="6" rwaccess="WO"/> 
		<bitfield id="E37" width="1" begin="5" end="5" resetval="0x0" description="Event Missed Clear #37" range="5" rwaccess="WO"/> 
		<bitfield id="E36" width="1" begin="4" end="4" resetval="0x0" description="Event Missed Clear #36" range="4" rwaccess="WO"/> 
		<bitfield id="E35" width="1" begin="3" end="3" resetval="0x0" description="Event Missed Clear #35" range="3" rwaccess="WO"/> 
		<bitfield id="E34" width="1" begin="2" end="2" resetval="0x0" description="Event Missed Clear #34" range="2" rwaccess="WO"/> 
		<bitfield id="E33" width="1" begin="1" end="1" resetval="0x0" description="Event Missed Clear  #33" range="1" rwaccess="WO"/> 
		<bitfield id="E32" width="1" begin="0" end="0" resetval="0x0" description="Event Missed Clear #32" range="0" rwaccess="WO"/>
	</register>
	<register id="TPCC0_QEMR" acronym="TPCC0_QEMR" offset="0x310" width="32" description="">
		<bitfield id="RES31" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="E7" width="1" begin="7" end="7" resetval="0x0" description="Event Missed #7" range="7" rwaccess="RO"/> 
		<bitfield id="E6" width="1" begin="6" end="6" resetval="0x0" description="Event Missed #6" range="6" rwaccess="RO"/> 
		<bitfield id="E5" width="1" begin="5" end="5" resetval="0x0" description="Event Missed #5" range="5" rwaccess="RO"/> 
		<bitfield id="E4" width="1" begin="4" end="4" resetval="0x0" description="Event Missed #4" range="4" rwaccess="RO"/> 
		<bitfield id="E3" width="1" begin="3" end="3" resetval="0x0" description="Event Missed #3" range="3" rwaccess="RO"/> 
		<bitfield id="E2" width="1" begin="2" end="2" resetval="0x0" description="Event Missed #2" range="2" rwaccess="RO"/> 
		<bitfield id="E1" width="1" begin="1" end="1" resetval="0x0" description="Event Missed #1" range="1" rwaccess="RO"/> 
		<bitfield id="E0" width="1" begin="0" end="0" resetval="0x0" description="Event Missed #0" range="0" rwaccess="RO"/>
	</register>
