IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TPCC0_TPCC0.xml
	<register id="TPCC0_QEMCR" acronym="TPCC0_QEMCR" offset="0x314" width="32" description="">
		<bitfield id="RES32" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="E7" width="1" begin="7" end="7" resetval="0x0" description="Event Missed Clear #7" range="7" rwaccess="WO"/> 
		<bitfield id="E6" width="1" begin="6" end="6" resetval="0x0" description="Event Missed Clear #6" range="6" rwaccess="WO"/> 
		<bitfield id="E5" width="1" begin="5" end="5" resetval="0x0" description="Event Missed Clear #5" range="5" rwaccess="WO"/> 
		<bitfield id="E4" width="1" begin="4" end="4" resetval="0x0" description="Event Missed Clear #4" range="4" rwaccess="WO"/> 
		<bitfield id="E3" width="1" begin="3" end="3" resetval="0x0" description="Event Missed Clear #3" range="3" rwaccess="WO"/> 
		<bitfield id="E2" width="1" begin="2" end="2" resetval="0x0" description="Event Missed Clear #2" range="2" rwaccess="WO"/> 
		<bitfield id="E1" width="1" begin="1" end="1" resetval="0x0" description="Event Missed Clear #1" range="1" rwaccess="WO"/> 
		<bitfield id="E0" width="1" begin="0" end="0" resetval="0x0" description="Event Missed Clear #0" range="0" rwaccess="WO"/>
	</register>
	<register id="TPCC0_CCERR" acronym="TPCC0_CCERR" offset="0x318" width="32" description="">
		<bitfield id="RES33" width="15" begin="31" end="17" resetval="0x0" description="RESERVE FIELD" range="31 - 17" rwaccess="RO"/> 
		<bitfield id="TCERR" width="1" begin="16" end="16" resetval="0x0" description="Transfer Completion Code Error:  TCCERR = 0 : Total number  of allowed TCCs outstanding has not been reached. TCCERR = 1  : Total number of allowed TCCs has been reached.  TCCERR can  be cleared by writing a '1' to corresponding bit in CCERRCLR  register. If any bit in the CCERR register is set (and all  errors were previously clear) then an error will be  signaled with TPCC error interrupt." range="16" rwaccess="RO"/> 
		<bitfield id="RES34" width="8" begin="15" end="8" resetval="0x0" description="RESERVE FIELD" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="QTHRXCD7" width="1" begin="7" end="7" resetval="0x0" description="Queue Threshold Error for Q7:  QTHRXCD7 = 0 :  Watermark/threshold has not been exceeded. QTHRXCD7 = 1 :  Watermark/threshold has been exceeded.  CCERR.QTHRXCD7 can  be cleared by writing a '1' to corresponding bit in CCERRCLR  register. If any bit in the CCERR register is set (and all  errors (including EMR/QEMR) were previously clear) then an  error will be signaled with the TPCC error interrupt." range="7" rwaccess="RO"/> 
		<bitfield id="QTHRXCD6" width="1" begin="6" end="6" resetval="0x0" description="Queue Threshold Error for Q6:  QTHRXCD6 = 0 :  Watermark/threshold has not been exceeded. QTHRXCD6 = 1 :  Watermark/threshold has been exceeded.  CCERR.QTHRXCD6 can  be cleared by writing a '1' to corresponding bit in CCERRCLR  register. If any bit in the CCERR register is set (and all  errors (including EMR/QEMR) were previously clear) then an  error will be signaled with the TPCC error interrupt." range="6" rwaccess="RO"/> 
		<bitfield id="QTHRXCD5" width="1" begin="5" end="5" resetval="0x0" description="Queue Threshold Error for Q5:  QTHRXCD5 = 0 :  Watermark/threshold has not been exceeded. QTHRXCD5 = 1 :  Watermark/threshold has been exceeded.  CCERR.QTHRXCD5 can  be cleared by writing a '1' to corresponding bit in CCERRCLR  register. If any bit in the CCERR register is set (and all  errors (including EMR/QEMR) were previously clear) then an  error will be signaled with the TPCC error interrupt." range="5" rwaccess="RO"/> 
		<bitfield id="QTHRXCD4" width="1" begin="4" end="4" resetval="0x0" description="Queue Threshold Error for Q4:  QTHRXCD4 = 0 :  Watermark/threshold has not been exceeded. QTHRXCD4 = 1 :  Watermark/threshold has been exceeded.  CCERR.QTHRXCD4 can  be cleared by writing a '1' to corresponding bit in CCERRCLR  register. If any bit in the CCERR register is set (and all  errors (including EMR/QEMR) were previously clear) then an  error will be signaled with the TPCC error interrupt." range="4" rwaccess="RO"/> 
		<bitfield id="QTHRXCD3" width="1" begin="3" end="3" resetval="0x0" description="Queue Threshold Error for Q3:  QTHRXCD3 = 0 :  Watermark/threshold has not been exceeded. QTHRXCD3 = 1 :  Watermark/threshold has been exceeded.  CCERR.QTHRXCD3 can  be cleared by writing a '1' to corresponding bit in CCERRCLR  register. If any bit in the CCERR register is set (and all  errors (including EMR/QEMR) were previously clear) then an  error will be signaled with the TPCC error interrupt." range="3" rwaccess="RO"/> 
		<bitfield id="QTHRXCD2" width="1" begin="2" end="2" resetval="0x0" description="Queue Threshold Error for Q2:  QTHRXCD2 = 0 :  Watermark/threshold has not been exceeded. QTHRXCD2 = 1 :  Watermark/threshold has been exceeded.  CCERR.QTHRXCD2 can  be cleared by writing a '1' to corresponding bit in CCERRCLR  register. If any bit in the CCERR register is set (and all  errors (including EMR/QEMR) were previously clear) then an  error will be signaled with the TPCC error interrupt." range="2" rwaccess="RO"/> 
		<bitfield id="QTHRXCD1" width="1" begin="1" end="1" resetval="0x0" description="Queue Threshold Error for Q1:  QTHRXCD1 = 0 :  Watermark/threshold has not been exceeded. QTHRXCD1 = 1 :  Watermark/threshold has been exceeded.  CCERR.QTHRXCD1 can  be cleared by writing a '1' to corresponding bit in CCERRCLR  register. If any bit in the CCERR register is set (and all  errors (including EMR/QEMR) were previously clear) then an  error will be signaled with the TPCC error interrupt." range="1" rwaccess="RO"/> 
		<bitfield id="QTHRXCD0" width="1" begin="0" end="0" resetval="0x0" description="Queue Threshold Error for Q0:  QTHRXCD0 = 0 :  Watermark/threshold has not been exceeded. QTHRXCD0 = 1 :  Watermark/threshold has been exceeded.  CCERR.QTHRXCD0 can  be cleared by writing a '1' to corresponding bit in CCERRCLR  register. If any bit in the CCERR register is set (and all  errors (including EMR/QEMR) were previously clear) then an  error will be signaled with the TPCC error interrupt." range="0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_CCERRCLR" acronym="TPCC0_CCERRCLR" offset="0x31C" width="32" description="">
		<bitfield id="RES35" width="15" begin="31" end="17" resetval="0x0" description="RESERVE FIELD" range="31 - 17" rwaccess="RO"/> 
		<bitfield id="TCERR" width="1" begin="16" end="16" resetval="0x0" description="Clear Error for CCERR.TCERR:  Write of '1' clears the value  of CCERR bit N. Writes of '0' have no affect." range="16" rwaccess="WO"/> 
		<bitfield id="RES36" width="8" begin="15" end="8" resetval="0x0" description="RESERVE FIELD" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="QTHRXCD7" width="1" begin="7" end="7" resetval="0x0" description="Clear error for CCERR.QTHRXCD7:  Write of '1' clears the  values of QSTAT7.WM QSTAT7.THRXCD CCERR.QTHRXCD7 Writes of  '0' have no affect." range="7" rwaccess="WO"/> 
		<bitfield id="QTHRXCD6" width="1" begin="6" end="6" resetval="0x0" description="Clear error for CCERR.QTHRXCD6:  Write of '1' clears the  values of QSTAT6.WM QSTAT6.THRXCD CCERR.QTHRXCD6 Writes of  '0' have no affect." range="6" rwaccess="WO"/> 
		<bitfield id="QTHRXCD5" width="1" begin="5" end="5" resetval="0x0" description="Clear error for CCERR.QTHRXCD5:  Write of '1' clears the  values of QSTAT5.WM QSTAT5.THRXCD CCERR.QTHRXCD5 Writes of  '0' have no affect." range="5" rwaccess="WO"/> 
		<bitfield id="QTHRXCD4" width="1" begin="4" end="4" resetval="0x0" description="Clear error for CCERR.QTHRXCD4:  Write of '1' clears the  values of QSTAT4.WM QSTAT4.THRXCD CCERR.QTHRXCD4 Writes of  '0' have no affect." range="4" rwaccess="WO"/> 
		<bitfield id="QTHRXCD3" width="1" begin="3" end="3" resetval="0x0" description="Clear error for CCERR.QTHRXCD3:  Write of '1' clears the  values of QSTAT3.WM QSTAT3.THRXCD CCERR.QTHRXCD3 Writes of  '0' have no affect." range="3" rwaccess="WO"/> 
		<bitfield id="QTHRXCD2" width="1" begin="2" end="2" resetval="0x0" description="Clear error for CCERR.QTHRXCD2:  Write of '1' clears the  values of QSTAT2.WM QSTAT2.THRXCD CCERR.QTHRXCD2 Writes of  '0' have no affect." range="2" rwaccess="WO"/> 
		<bitfield id="QTHRXCD1" width="1" begin="1" end="1" resetval="0x0" description="Clear error for CCERR.QTHRXCD1:  Write of '1' clears the  values of QSTAT1.WM QSTAT1.THRXCD CCERR.QTHRXCD1 Writes of  '0' have no affect." range="1" rwaccess="WO"/> 
		<bitfield id="QTHRXCD0" width="1" begin="0" end="0" resetval="0x0" description="Clear error for CCERR.QTHRXCD0:  Write of '1' clears the  values of QSTAT0.WM QSTAT0.THRXCD CCERR.QTHRXCD0 Writes of  '0' have no affect." range="0" rwaccess="WO"/>
	</register>
	<register id="TPCC0_EEVAL" acronym="TPCC0_EEVAL" offset="0x320" width="32" description="">
		<bitfield id="RES37" width="30" begin="31" end="2" resetval="0x0" description="RESERVE FIELD" range="31 - 2" rwaccess="RO"/> 
		<bitfield id="SET" width="1" begin="1" end="1" resetval="0x0" description="Error Interrupt Set:  CPU write of '1' to the SET bit causes  the TPCC error interrupt to be pulsed regardless of state of  EMR/EMRH QEMR or CCERR. CPU write of '0' has no effect." range="1" rwaccess="WO"/> 
		<bitfield id="EVAL" width="1" begin="0" end="0" resetval="0x0" description="Error Interrupt Evaluate:  CPU write of '1' to the EVAL bit  causes the TPCC error interrupt to be pulsed if any errors  have not been cleared in the EMR/EMRH QEMR or CCERR  registers. CPU write of '0' has no effect." range="0" rwaccess="WO"/>
	</register>
	<register id="TPCC0_DRAEM" acronym="TPCC0_DRAEM" offset="0x340" width="32" description="">
		<bitfield id="E31" width="1" begin="31" end="31" resetval="0x0" description="DMA Region Access enable for Region M bit #31" range="31" rwaccess="RW"/> 
		<bitfield id="E30" width="1" begin="30" end="30" resetval="0x0" description="DMA Region Access enable for Region M bit #30" range="30" rwaccess="RW"/> 
		<bitfield id="E29" width="1" begin="29" end="29" resetval="0x0" description="DMA Region Access enable for Region M bit #29" range="29" rwaccess="RW"/> 
		<bitfield id="E28" width="1" begin="28" end="28" resetval="0x0" description="DMA Region Access enable for Region M bit #28" range="28" rwaccess="RW"/> 
		<bitfield id="E27" width="1" begin="27" end="27" resetval="0x0" description="DMA Region Access enable for Region M bit #27" range="27" rwaccess="RW"/> 
		<bitfield id="E26" width="1" begin="26" end="26" resetval="0x0" description="DMA Region Access enable for Region M bit #26" range="26" rwaccess="RW"/> 
		<bitfield id="E25" width="1" begin="25" end="25" resetval="0x0" description="DMA Region Access enable for Region M bit #25" range="25" rwaccess="RW"/> 
		<bitfield id="E24" width="1" begin="24" end="24" resetval="0x0" description="DMA Region Access enable for Region M bit #24" range="24" rwaccess="RW"/> 
		<bitfield id="E23" width="1" begin="23" end="23" resetval="0x0" description="DMA Region Access enable for Region M bit #23" range="23" rwaccess="RW"/> 
		<bitfield id="E22" width="1" begin="22" end="22" resetval="0x0" description="DMA Region Access enable for Region M bit #22" range="22" rwaccess="RW"/> 
		<bitfield id="E21" width="1" begin="21" end="21" resetval="0x0" description="DMA Region Access enable for Region M bit #21" range="21" rwaccess="RW"/> 
		<bitfield id="E20" width="1" begin="20" end="20" resetval="0x0" description="DMA Region Access enable for Region M bit #20" range="20" rwaccess="RW"/> 
		<bitfield id="E19" width="1" begin="19" end="19" resetval="0x0" description="DMA Region Access enable for Region M bit #19" range="19" rwaccess="RW"/> 
		<bitfield id="E18" width="1" begin="18" end="18" resetval="0x0" description="DMA Region Access enable for Region M bit #18" range="18" rwaccess="RW"/> 
		<bitfield id="E17" width="1" begin="17" end="17" resetval="0x0" description="DMA Region Access enable for Region M bit #17" range="17" rwaccess="RW"/> 
		<bitfield id="E16" width="1" begin="16" end="16" resetval="0x0" description="DMA Region Access enable for Region M bit #16" range="16" rwaccess="RW"/> 
		<bitfield id="E15" width="1" begin="15" end="15" resetval="0x0" description="DMA Region Access enable for Region M bit #15" range="15" rwaccess="RW"/> 
		<bitfield id="E14" width="1" begin="14" end="14" resetval="0x0" description="DMA Region Access enable for Region M bit #14" range="14" rwaccess="RW"/> 
		<bitfield id="E13" width="1" begin="13" end="13" resetval="0x0" description="DMA Region Access enable for Region M bit #13" range="13" rwaccess="RW"/> 
		<bitfield id="E12" width="1" begin="12" end="12" resetval="0x0" description="DMA Region Access enable for Region M bit #12" range="12" rwaccess="RW"/> 
		<bitfield id="E11" width="1" begin="11" end="11" resetval="0x0" description="DMA Region Access enable for Region M bit #11" range="11" rwaccess="RW"/> 
		<bitfield id="E10" width="1" begin="10" end="10" resetval="0x0" description="DMA Region Access enable for Region M bit #10" range="10" rwaccess="RW"/> 
		<bitfield id="E9" width="1" begin="9" end="9" resetval="0x0" description="DMA Region Access enable for Region M bit #9" range="9" rwaccess="RW"/> 
		<bitfield id="E8" width="1" begin="8" end="8" resetval="0x0" description="DMA Region Access enable for Region M bit #8" range="8" rwaccess="RW"/> 
		<bitfield id="E7" width="1" begin="7" end="7" resetval="0x0" description="DMA Region Access enable for Region M bit #7" range="7" rwaccess="RW"/> 
		<bitfield id="E6" width="1" begin="6" end="6" resetval="0x0" description="DMA Region Access enable for Region M bit #6" range="6" rwaccess="RW"/> 
		<bitfield id="E5" width="1" begin="5" end="5" resetval="0x0" description="DMA Region Access enable for Region M bit #5" range="5" rwaccess="RW"/> 
		<bitfield id="E4" width="1" begin="4" end="4" resetval="0x0" description="DMA Region Access enable for Region M bit #4" range="4" rwaccess="RW"/> 
		<bitfield id="E3" width="1" begin="3" end="3" resetval="0x0" description="DMA Region Access enable for Region M bit #3" range="3" rwaccess="RW"/> 
		<bitfield id="E2" width="1" begin="2" end="2" resetval="0x0" description="DMA Region Access enable for Region M bit #2" range="2" rwaccess="RW"/> 
		<bitfield id="E1" width="1" begin="1" end="1" resetval="0x0" description="DMA Region Access enable for Region M bit #1" range="1" rwaccess="RW"/> 
		<bitfield id="E0" width="1" begin="0" end="0" resetval="0x0" description="DMA Region Access enable for Region M bit #0" range="0" rwaccess="RW"/>
	</register>
	<register id="TPCC0_DRAEHM" acronym="TPCC0_DRAEHM" offset="0x344" width="32" description="">
		<bitfield id="E63" width="1" begin="31" end="31" resetval="0x0" description="DMA Region Access enable for Region M bit #63" range="31" rwaccess="RW"/> 
		<bitfield id="E62" width="1" begin="30" end="30" resetval="0x0" description="DMA Region Access enable for Region M bit #62" range="30" rwaccess="RW"/> 
		<bitfield id="E61" width="1" begin="29" end="29" resetval="0x0" description="DMA Region Access enable for Region M bit #61" range="29" rwaccess="RW"/> 
		<bitfield id="E60" width="1" begin="28" end="28" resetval="0x0" description="DMA Region Access enable for Region M bit #60" range="28" rwaccess="RW"/> 
		<bitfield id="E59" width="1" begin="27" end="27" resetval="0x0" description="DMA Region Access enable for Region M bit #59" range="27" rwaccess="RW"/> 
		<bitfield id="E58" width="1" begin="26" end="26" resetval="0x0" description="DMA Region Access enable for Region M bit #58" range="26" rwaccess="RW"/> 
		<bitfield id="E57" width="1" begin="25" end="25" resetval="0x0" description="DMA Region Access enable for Region M bit #57" range="25" rwaccess="RW"/> 
		<bitfield id="E56" width="1" begin="24" end="24" resetval="0x0" description="DMA Region Access enable for Region M bit #56" range="24" rwaccess="RW"/> 
		<bitfield id="E55" width="1" begin="23" end="23" resetval="0x0" description="DMA Region Access enable for Region M bit #55" range="23" rwaccess="RW"/> 
		<bitfield id="E54" width="1" begin="22" end="22" resetval="0x0" description="DMA Region Access enable for Region M bit #54" range="22" rwaccess="RW"/> 
		<bitfield id="E53" width="1" begin="21" end="21" resetval="0x0" description="DMA Region Access enable for Region M bit #53" range="21" rwaccess="RW"/> 
		<bitfield id="E52" width="1" begin="20" end="20" resetval="0x0" description="DMA Region Access enable for Region M bit #52" range="20" rwaccess="RW"/> 
		<bitfield id="E51" width="1" begin="19" end="19" resetval="0x0" description="DMA Region Access enable for Region M bit #51" range="19" rwaccess="RW"/> 
		<bitfield id="E50" width="1" begin="18" end="18" resetval="0x0" description="DMA Region Access enable for Region M bit #50" range="18" rwaccess="RW"/> 
		<bitfield id="E49" width="1" begin="17" end="17" resetval="0x0" description="DMA Region Access enable for Region M bit #49" range="17" rwaccess="RW"/> 
		<bitfield id="E48" width="1" begin="16" end="16" resetval="0x0" description="DMA Region Access enable for Region M bit #48" range="16" rwaccess="RW"/> 
		<bitfield id="E47" width="1" begin="15" end="15" resetval="0x0" description="DMA Region Access enable for Region M bit #47" range="15" rwaccess="RW"/> 
		<bitfield id="E46" width="1" begin="14" end="14" resetval="0x0" description="DMA Region Access enable for Region M bit #46" range="14" rwaccess="RW"/> 
		<bitfield id="E45" width="1" begin="13" end="13" resetval="0x0" description="DMA Region Access enable for Region M bit #45" range="13" rwaccess="RW"/> 
		<bitfield id="E44" width="1" begin="12" end="12" resetval="0x0" description="DMA Region Access enable for Region M bit #44" range="12" rwaccess="RW"/> 
		<bitfield id="E43" width="1" begin="11" end="11" resetval="0x0" description="DMA Region Access enable for Region M bit #43" range="11" rwaccess="RW"/> 
		<bitfield id="E42" width="1" begin="10" end="10" resetval="0x0" description="DMA Region Access enable for Region M bit #42" range="10" rwaccess="RW"/> 
		<bitfield id="E41" width="1" begin="9" end="9" resetval="0x0" description="DMA Region Access enable for Region M bit #41" range="9" rwaccess="RW"/> 
		<bitfield id="E40" width="1" begin="8" end="8" resetval="0x0" description="DMA Region Access enable for Region M bit #40" range="8" rwaccess="RW"/> 
		<bitfield id="E39" width="1" begin="7" end="7" resetval="0x0" description="DMA Region Access enable for Region M bit #39" range="7" rwaccess="RW"/> 
		<bitfield id="E38" width="1" begin="6" end="6" resetval="0x0" description="DMA Region Access enable for Region M bit #38" range="6" rwaccess="RW"/> 
		<bitfield id="E37" width="1" begin="5" end="5" resetval="0x0" description="DMA Region Access enable for Region M bit #37" range="5" rwaccess="RW"/> 
		<bitfield id="E36" width="1" begin="4" end="4" resetval="0x0" description="DMA Region Access enable for Region M bit #36" range="4" rwaccess="RW"/> 
		<bitfield id="E35" width="1" begin="3" end="3" resetval="0x0" description="DMA Region Access enable for Region M bit #35" range="3" rwaccess="RW"/> 
		<bitfield id="E34" width="1" begin="2" end="2" resetval="0x0" description="DMA Region Access enable for Region M bit #34" range="2" rwaccess="RW"/> 
		<bitfield id="E33" width="1" begin="1" end="1" resetval="0x0" description="DMA Region Access enable for Region M bit #33" range="1" rwaccess="RW"/> 
		<bitfield id="E32" width="1" begin="0" end="0" resetval="0x0" description="DMA Region Access enable for Region M bit #32" range="0" rwaccess="RW"/>
	</register>
