IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TPCC0_TPCC0.xml
	<register id="TPCC0_QRAEN" acronym="TPCC0_QRAEN" offset="0x380" width="32" description="">
		<bitfield id="RES38" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="E7" width="1" begin="7" end="7" resetval="0x0" description="QDMA Region Access enable for Region M bit #7" range="7" rwaccess="RW"/> 
		<bitfield id="E6" width="1" begin="6" end="6" resetval="0x0" description="QDMA Region Access enable for Region M bit #6" range="6" rwaccess="RW"/> 
		<bitfield id="E5" width="1" begin="5" end="5" resetval="0x0" description="QDMA Region Access enable for Region M bit #5" range="5" rwaccess="RW"/> 
		<bitfield id="E4" width="1" begin="4" end="4" resetval="0x0" description="QDMA Region Access enable for Region M bit #4" range="4" rwaccess="RW"/> 
		<bitfield id="E3" width="1" begin="3" end="3" resetval="0x0" description="QDMA Region Access enable for Region M bit #3" range="3" rwaccess="RW"/> 
		<bitfield id="E2" width="1" begin="2" end="2" resetval="0x0" description="QDMA Region Access enable for Region M bit #2" range="2" rwaccess="RW"/> 
		<bitfield id="E1" width="1" begin="1" end="1" resetval="0x0" description="QDMA Region Access enable for Region M bit #1" range="1" rwaccess="RW"/> 
		<bitfield id="E0" width="1" begin="0" end="0" resetval="0x0" description="QDMA Region Access enable for Region M bit #0" range="0" rwaccess="RW"/>
	</register>
	<register id="TPCC0_QNE0" acronym="TPCC0_QNE0" offset="0x400" width="32" description="">
		<bitfield id="RES39" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="ETYPE" width="2" begin="7" end="6" resetval="0x0" description="Event Type: Specifies the specific Event Type for the given  entry in the Event Queue." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="ENUM" width="6" begin="5" end="0" resetval="0x0" description="Event Number: Specifies the specific Event Number for the  given entry in the Event Queue. For DMA Channel events  (ER/ESR/CER) ENUM will range between 0 and NUM_DMACH (up to  63). For QDMA Channel events (QER) ENUM will range between  0 and NUM_QDMACH (up to 7)." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QNE1" acronym="TPCC0_QNE1" offset="0x404" width="32" description="">
		<bitfield id="RES40" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="ETYPE" width="2" begin="7" end="6" resetval="0x0" description="Event Type: Specifies the specific Event Type for the given  entry in the Event Queue." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="ENUM" width="6" begin="5" end="0" resetval="0x0" description="Event Number: Specifies the specific Event Number for the  given entry in the Event Queue. For DMA Channel events  (ER/ESR/CER) ENUM will range between 0 and NUM_DMACH (up to  63). For QDMA Channel events (QER) ENUM will range between  0 and NUM_QDMACH (up to 7)." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QNE2" acronym="TPCC0_QNE2" offset="0x408" width="32" description="">
		<bitfield id="RES41" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="ETYPE" width="2" begin="7" end="6" resetval="0x0" description="Event Type: Specifies the specific Event Type for the given  entry in the Event Queue." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="ENUM" width="6" begin="5" end="0" resetval="0x0" description="Event Number: Specifies the specific Event Number for the  given entry in the Event Queue. For DMA Channel events  (ER/ESR/CER) ENUM will range between 0 and NUM_DMACH (up to  63). For QDMA Channel events (QER) ENUM will range between  0 and NUM_QDMACH (up to 7)." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QNE3" acronym="TPCC0_QNE3" offset="0x40C" width="32" description="">
		<bitfield id="RES42" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="ETYPE" width="2" begin="7" end="6" resetval="0x0" description="Event Type: Specifies the specific Event Type for the given  entry in the Event Queue." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="ENUM" width="6" begin="5" end="0" resetval="0x0" description="Event Number: Specifies the specific Event Number for the  given entry in the Event Queue. For DMA Channel events  (ER/ESR/CER) ENUM will range between 0 and NUM_DMACH (up to  63). For QDMA Channel events (QER) ENUM will range between  0 and NUM_QDMACH (up to 7)." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QNE4" acronym="TPCC0_QNE4" offset="0x410" width="32" description="">
		<bitfield id="RES43" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="ETYPE" width="2" begin="7" end="6" resetval="0x0" description="Event Type: Specifies the specific Event Type for the given  entry in the Event Queue." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="ENUM" width="6" begin="5" end="0" resetval="0x0" description="Event Number: Specifies the specific Event Number for the  given entry in the Event Queue. For DMA Channel events  (ER/ESR/CER) ENUM will range between 0 and NUM_DMACH (up to  63). For QDMA Channel events (QER) ENUM will range between  0 and NUM_QDMACH (up to 7)." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QNE5" acronym="TPCC0_QNE5" offset="0x414" width="32" description="">
		<bitfield id="RES44" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="ETYPE" width="2" begin="7" end="6" resetval="0x0" description="Event Type: Specifies the specific Event Type for the given  entry in the Event Queue." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="ENUM" width="6" begin="5" end="0" resetval="0x0" description="Event Number: Specifies the specific Event Number for the  given entry in the Event Queue. For DMA Channel events  (ER/ESR/CER) ENUM will range between 0 and NUM_DMACH (up to  63). For QDMA Channel events (QER) ENUM will range between  0 and NUM_QDMACH (up to 7)." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QNE6" acronym="TPCC0_QNE6" offset="0x418" width="32" description="">
		<bitfield id="RES45" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="ETYPE" width="2" begin="7" end="6" resetval="0x0" description="Event Type: Specifies the specific Event Type for the given  entry in the Event Queue." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="ENUM" width="6" begin="5" end="0" resetval="0x0" description="Event Number: Specifies the specific Event Number for the  given entry in the Event Queue. For DMA Channel events  (ER/ESR/CER) ENUM will range between 0 and NUM_DMACH (up to  63). For QDMA Channel events (QER) ENUM will range between  0 and NUM_QDMACH (up to 7)." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QNE7" acronym="TPCC0_QNE7" offset="0x41C" width="32" description="">
		<bitfield id="RES46" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="ETYPE" width="2" begin="7" end="6" resetval="0x0" description="Event Type: Specifies the specific Event Type for the given  entry in the Event Queue." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="ENUM" width="6" begin="5" end="0" resetval="0x0" description="Event Number: Specifies the specific Event Number for the  given entry in the Event Queue. For DMA Channel events  (ER/ESR/CER) ENUM will range between 0 and NUM_DMACH (up to  63). For QDMA Channel events (QER) ENUM will range between  0 and NUM_QDMACH (up to 7)." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QNE8" acronym="TPCC0_QNE8" offset="0x420" width="32" description="">
		<bitfield id="RES47" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="ETYPE" width="2" begin="7" end="6" resetval="0x0" description="Event Type: Specifies the specific Event Type for the given  entry in the Event Queue." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="ENUM" width="6" begin="5" end="0" resetval="0x0" description="Event Number: Specifies the specific Event Number for the  given entry in the Event Queue. For DMA Channel events  (ER/ESR/CER) ENUM will range between 0 and NUM_DMACH (up to  63). For QDMA Channel events (QER) ENUM will range between  0 and NUM_QDMACH (up to 7)." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QNE9" acronym="TPCC0_QNE9" offset="0x424" width="32" description="">
		<bitfield id="RES48" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="ETYPE" width="2" begin="7" end="6" resetval="0x0" description="Event Type: Specifies the specific Event Type for the given  entry in the Event Queue." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="ENUM" width="6" begin="5" end="0" resetval="0x0" description="Event Number: Specifies the specific Event Number for the  given entry in the Event Queue. For DMA Channel events  (ER/ESR/CER) ENUM will range between 0 and NUM_DMACH (up to  63). For QDMA Channel events (QER) ENUM will range between  0 and NUM_QDMACH (up to 7)." range="5 - 0" rwaccess="RO"/>
	</register>
