IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TPCC0_TPCC0.xml
	<register id="TPCC0_QNE10" acronym="TPCC0_QNE10" offset="0x428" width="32" description="">
		<bitfield id="RES49" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="ETYPE" width="2" begin="7" end="6" resetval="0x0" description="Event Type: Specifies the specific Event Type for the given  entry in the Event Queue." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="ENUM" width="6" begin="5" end="0" resetval="0x0" description="Event Number: Specifies the specific Event Number for the  given entry in the Event Queue. For DMA Channel events  (ER/ESR/CER) ENUM will range between 0 and NUM_DMACH (up to  63). For QDMA Channel events (QER) ENUM will range between  0 and NUM_QDMACH (up to 7)." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QNE11" acronym="TPCC0_QNE11" offset="0x42C" width="32" description="">
		<bitfield id="RES50" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="ETYPE" width="2" begin="7" end="6" resetval="0x0" description="Event Type: Specifies the specific Event Type for the given  entry in the Event Queue." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="ENUM" width="6" begin="5" end="0" resetval="0x0" description="Event Number: Specifies the specific Event Number for the  given entry in the Event Queue. For DMA Channel events  (ER/ESR/CER) ENUM will range between 0 and NUM_DMACH (up to  63). For QDMA Channel events (QER) ENUM will range between  0 and NUM_QDMACH (up to 7)." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QNE12" acronym="TPCC0_QNE12" offset="0x430" width="32" description="">
		<bitfield id="RES51" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="ETYPE" width="2" begin="7" end="6" resetval="0x0" description="Event Type: Specifies the specific Event Type for the given  entry in the Event Queue." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="ENUM" width="6" begin="5" end="0" resetval="0x0" description="Event Number: Specifies the specific Event Number for the  given entry in the Event Queue. For DMA Channel events  (ER/ESR/CER) ENUM will range between 0 and NUM_DMACH (up to  63). For QDMA Channel events (QER) ENUM will range between  0 and NUM_QDMACH (up to 7)." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QNE13" acronym="TPCC0_QNE13" offset="0x434" width="32" description="">
		<bitfield id="RES52" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="ETYPE" width="2" begin="7" end="6" resetval="0x0" description="Event Type: Specifies the specific Event Type for the given  entry in the Event Queue." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="ENUM" width="6" begin="5" end="0" resetval="0x0" description="Event Number: Specifies the specific Event Number for the  given entry in the Event Queue. For DMA Channel events  (ER/ESR/CER) ENUM will range between 0 and NUM_DMACH (up to  63). For QDMA Channel events (QER) ENUM will range between  0 and NUM_QDMACH (up to 7)." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QNE14" acronym="TPCC0_QNE14" offset="0x438" width="32" description="">
		<bitfield id="RES53" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="ETYPE" width="2" begin="7" end="6" resetval="0x0" description="Event Type: Specifies the specific Event Type for the given  entry in the Event Queue." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="ENUM" width="6" begin="5" end="0" resetval="0x0" description="Event Number: Specifies the specific Event Number for the  given entry in the Event Queue. For DMA Channel events  (ER/ESR/CER) ENUM will range between 0 and NUM_DMACH (up to  63). For QDMA Channel events (QER) ENUM will range between  0 and NUM_QDMACH (up to 7)." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QNE15" acronym="TPCC0_QNE15" offset="0x43C" width="32" description="">
		<bitfield id="RES54" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="ETYPE" width="2" begin="7" end="6" resetval="0x0" description="Event Type: Specifies the specific Event Type for the given  entry in the Event Queue." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="ENUM" width="6" begin="5" end="0" resetval="0x0" description="Event Number: Specifies the specific Event Number for the  given entry in the Event Queue. For DMA Channel events  (ER/ESR/CER) ENUM will range between 0 and NUM_DMACH (up to  63). For QDMA Channel events (QER) ENUM will range between  0 and NUM_QDMACH (up to 7)." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QSTATN" acronym="TPCC0_QSTATN" offset="0x600" width="32" description="">
		<bitfield id="RES55" width="7" begin="31" end="25" resetval="0x0" description="RESERVE FIELD" range="31 - 25" rwaccess="RO"/> 
		<bitfield id="THRXCD" width="1" begin="24" end="24" resetval="0x0" description="Threshold Exceeded:  THRXCD = 0 : Threshold specified by  QWMTHR(A  B).Qn has not been exceeded. THRXCD = 1 : Threshold  specified by QWMTHR(A  B).Qn has been exceeded.  QSTATn.THRXCD is cleared via  CCERR.WMCLRn bit." range="24" rwaccess="RO"/> 
		<bitfield id="RES56" width="3" begin="23" end="21" resetval="0x0" description="RESERVE FIELD" range="23 - 21" rwaccess="RO"/> 
		<bitfield id="WM" width="5" begin="20" end="16" resetval="0x0" description="Watermark for Maximum Queue Usage:  Watermark tracks the  most entries that have been in QueueN since reset or since  the last time that the watermark (WM) was cleared. QSTATn.WM  is cleared via CCERR.WMCLRn bit.  Legal values = 0x0 (empty)  to 0x10 (full)" range="20 - 16" rwaccess="RO"/> 
		<bitfield id="RES57" width="3" begin="15" end="13" resetval="0x0" description="RESERVE FIELD" range="15 - 13" rwaccess="RO"/> 
		<bitfield id="NUMVAL" width="5" begin="12" end="8" resetval="0x0" description="Number of Valid Entries in QueueN:  Represents the total  number of entries residing in the Queue Manager FIFO at a  given instant. Always enabled. Legal values = 0x0 (empty) to  0x10 (full)" range="12 - 8" rwaccess="RO"/> 
		<bitfield id="RES58" width="4" begin="7" end="4" resetval="0x0" description="RESERVE FIELD" range="7 - 4" rwaccess="RO"/> 
		<bitfield id="STRTPTR" width="4" begin="3" end="0" resetval="0x0" description="Start Pointer:  Represents the offset to the head entry of  QueueN in units of entries. Always enabled. Legal values  = 0x0 (0th entry) to 0xF (15th entry)" range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QWMTHRA" acronym="TPCC0_QWMTHRA" offset="0x620" width="32" description="">
		<bitfield id="RES59" width="19" begin="31" end="13" resetval="0x0" description="RESERVE FIELD" range="31 - 13" rwaccess="RO"/> 
		<bitfield id="Q1" width="5" begin="12" end="8" resetval="0x16" description="Queue Threshold for Q1 value" range="12 - 8" rwaccess="RW"/> 
		<bitfield id="RES60" width="3" begin="7" end="5" resetval="0x0" description="RESERVE FIELD" range="7 - 5" rwaccess="RO"/> 
		<bitfield id="Q0" width="5" begin="4" end="0" resetval="0x16" description="Queue Threshold for Q0 value" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="TPCC0_CCSTAT" acronym="TPCC0_CCSTAT" offset="0x640" width="32" description="">
		<bitfield id="RES61" width="8" begin="31" end="24" resetval="0x0" description="RESERVE FIELD" range="31 - 24" rwaccess="RO"/> 
		<bitfield id="QUEACTV7" width="1" begin="23" end="23" resetval="0x0" description="Queue 7 Active QUEACTV7 = 0 : No Evts are queued in Q7.  QUEACTV7 = 1 : At least one TR is queued in Q7." range="23" rwaccess="RO"/> 
		<bitfield id="QUEACTV6" width="1" begin="22" end="22" resetval="0x0" description="Queue 6 Active QUEACTV6 = 0 : No Evts are queued in Q6.  QUEACTV6 = 1 : At least one TR is queued in Q6." range="22" rwaccess="RO"/> 
		<bitfield id="QUEACTV5" width="1" begin="21" end="21" resetval="0x0" description="Queue 5 Active QUEACTV5 = 0 : No Evts are queued in Q5.  QUEACTV5 = 1 : At least one TR is queued in Q5." range="21" rwaccess="RO"/> 
		<bitfield id="QUEACTV4" width="1" begin="20" end="20" resetval="0x0" description="Queue 4 Active QUEACTV4 = 0 : No Evts are queued in Q4.  QUEACTV4 = 1 : At least one TR is queued in Q4." range="20" rwaccess="RO"/> 
		<bitfield id="QUEACTV3" width="1" begin="19" end="19" resetval="0x0" description="Queue 3 Active QUEACTV3 = 0 : No Evts are queued in Q3.  QUEACTV3 = 1 : At least one TR is queued in Q3." range="19" rwaccess="RO"/> 
		<bitfield id="QUEACTV2" width="1" begin="18" end="18" resetval="0x0" description="Queue 2 Active QUEACTV2 = 0 : No Evts are queued in Q2.  QUEACTV2 = 1 : At least one TR is queued in Q2." range="18" rwaccess="RO"/> 
		<bitfield id="QUEACTV1" width="1" begin="17" end="17" resetval="0x0" description="Queue 1 Active QUEACTV1 = 0 : No Evts are queued in Q1.  QUEACTV1 = 1 : At least one TR is queued in Q1." range="17" rwaccess="RO"/> 
		<bitfield id="QUEACTV0" width="1" begin="16" end="16" resetval="0x0" description="Queue 0 Active QUEACTV0 = 0 : No Evts are queued in Q0.  QUEACTV0 = 1 : At least one TR is queued in Q0." range="16" rwaccess="RO"/> 
		<bitfield id="RES62" width="2" begin="15" end="14" resetval="0x0" description="RESERVE FIELD" range="15 - 14" rwaccess="RO"/> 
		<bitfield id="COMPACTV" width="6" begin="13" end="8" resetval="0x0" description="Completion Request Active:  Counter that tracks the total  number of completion requests submitted to the TC. The  counter increments when a TR is submitted with TCINTEN or  TCCHEN set to '1'. The counter decrements for every valid  completion code received from any of the external TCs. The  CC will not service new TRs if COMPACTV count is already at  the limit.   COMPACTV = 0 : No completion requests  outstanding. COMPACTV = 1: Total of '1' completion request  outstanding. ... COMPACTV = 63 : Total of 63 completion  requests are outstanding. No additional TRs will be  submitted until count is less than 63." range="13 - 8" rwaccess="RO"/> 
		<bitfield id="RES63" width="3" begin="7" end="5" resetval="0x0" description="RESERVE FIELD" range="7 - 5" rwaccess="RO"/> 
		<bitfield id="ACTV" width="1" begin="4" end="4" resetval="0x0" description="Channel Controller Active:  Channel Controller Active is a  logical-OR of each of the ACTV signals. The ACTV bit must  remain high through the life of a TR.  ACTV = 0 : Channel is  idle. ACTV = 1 : Channel is busy." range="4" rwaccess="RO"/> 
		<bitfield id="RES64" width="1" begin="3" end="3" resetval="0x0" description="RESERVE FIELD" range="3" rwaccess="RO"/> 
		<bitfield id="TRACTV" width="1" begin="2" end="2" resetval="0x0" description="Transfer Request Active: TRACTV = 0 : Transfer Request  processing/submission logic is inactive. TRACTV = 1 :  Transfer Request processing/submission logic is active." range="2" rwaccess="RO"/> 
		<bitfield id="QEVTACTV" width="1" begin="1" end="1" resetval="0x0" description="QDMA Event Active: QEVTACTV = 0 : No enabled QDMA Events are  active within the CC. QEVTACTV = 1 : At least one enabled  DMA Event (ER &#38; EER ESR CER) is active within the CC." range="1" rwaccess="RO"/> 
		<bitfield id="EVTACTV" width="1" begin="0" end="0" resetval="0x0" description="DMA Event Active: EVTACTV = 0 : No enabled DMA Events are  active within the CC. EVTACTV = 1 : At least one enabled DMA  Event (ER &#38; EER ESR CER) is active within the CC." range="0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_AETCTL" acronym="TPCC0_AETCTL" offset="0x700" width="32" description="">
		<bitfield id="EN" width="1" begin="31" end="31" resetval="0x0" description="AET Enable: EN = 0 : AET event generation is disabled. EN =  1 : AET event generation is enabled." range="31" rwaccess="RW"/> 
		<bitfield id="RES65" width="17" begin="30" end="14" resetval="0x0" description="RESERVE FIELD" range="30 - 14" rwaccess="RO"/> 
		<bitfield id="ENDINT" width="6" begin="13" end="8" resetval="0x0" description="AET End Interrupt: Dictates the completion interrupt number  that will force the tpcc_aet signal to be deasserted (low)" range="13 - 8" rwaccess="RW"/> 
		<bitfield id="RES66" width="1" begin="7" end="7" resetval="0x0" description="RESERVE FIELD" range="7" rwaccess="RO"/> 
		<bitfield id="TYPE" width="1" begin="6" end="6" resetval="0x0" description="AET Event Type: TYPE = 0 : Event specified by STARTEVT  applies to DMA Events (set by ER ESR or CER) TYPE = 1 :  Event specified by STARTEVT applies to QDMA Events" range="6" rwaccess="RW"/> 
		<bitfield id="STRTEVT" width="6" begin="5" end="0" resetval="0x0" description="AET Start Event: Dictates the Event Number that will force  the tpcc_aet signal to be asserted (high)" range="5 - 0" rwaccess="RW"/>
	</register>
	<register id="TPCC0_AETSTAT" acronym="TPCC0_AETSTAT" offset="0x704" width="32" description="">
		<bitfield id="RES67" width="31" begin="31" end="1" resetval="0x0" description="RESERVE FIELD" range="31 - 1" rwaccess="RO"/> 
		<bitfield id="STAT" width="1" begin="0" end="0" resetval="0x0" description="AET Status: AETSTAT = 0 : tpcc_aet is currently low. AETSTAT  = 1 : tpcc_aet is currently high." range="0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_AETCMD" acronym="TPCC0_AETCMD" offset="0x708" width="32" description="">
		<bitfield id="RES68" width="31" begin="31" end="1" resetval="0x0" description="RESERVE FIELD" range="31 - 1" rwaccess="RO"/> 
		<bitfield id="CLR" width="1" begin="0" end="0" resetval="0x0" description="AET Clear command: CPU write of '1' to the CLR bit causes  the tpcc_aet output signal and AETSTAT.STAT register to be  cleared. CPU write of '0' has no effect.." range="0" rwaccess="WO"/>
	</register>
	<register id="TPCC0_ER" acronym="TPCC0_ER" offset="0x1000" width="32" description="">
		<bitfield id="E31" width="1" begin="31" end="31" resetval="0x0" description="Event #31" range="31" rwaccess="RO"/> 
		<bitfield id="E30" width="1" begin="30" end="30" resetval="0x0" description="Event #30" range="30" rwaccess="RO"/> 
		<bitfield id="E29" width="1" begin="29" end="29" resetval="0x0" description="Event #29" range="29" rwaccess="RO"/> 
		<bitfield id="E28" width="1" begin="28" end="28" resetval="0x0" description="Event #28" range="28" rwaccess="RO"/> 
		<bitfield id="E27" width="1" begin="27" end="27" resetval="0x0" description="Event #27" range="27" rwaccess="RO"/> 
		<bitfield id="E26" width="1" begin="26" end="26" resetval="0x0" description="Event #26" range="26" rwaccess="RO"/> 
		<bitfield id="E25" width="1" begin="25" end="25" resetval="0x0" description="Event #25" range="25" rwaccess="RO"/> 
		<bitfield id="E24" width="1" begin="24" end="24" resetval="0x0" description="Event #24" range="24" rwaccess="RO"/> 
		<bitfield id="E23" width="1" begin="23" end="23" resetval="0x0" description="Event #23" range="23" rwaccess="RO"/> 
		<bitfield id="E22" width="1" begin="22" end="22" resetval="0x0" description="Event #22" range="22" rwaccess="RO"/> 
		<bitfield id="E21" width="1" begin="21" end="21" resetval="0x0" description="Event #21" range="21" rwaccess="RO"/> 
		<bitfield id="E20" width="1" begin="20" end="20" resetval="0x0" description="Event #20" range="20" rwaccess="RO"/> 
		<bitfield id="E19" width="1" begin="19" end="19" resetval="0x0" description="Event #19" range="19" rwaccess="RO"/> 
		<bitfield id="E18" width="1" begin="18" end="18" resetval="0x0" description="Event #18" range="18" rwaccess="RO"/> 
		<bitfield id="E17" width="1" begin="17" end="17" resetval="0x0" description="Event #17" range="17" rwaccess="RO"/> 
		<bitfield id="E16" width="1" begin="16" end="16" resetval="0x0" description="Event #16" range="16" rwaccess="RO"/> 
		<bitfield id="E15" width="1" begin="15" end="15" resetval="0x0" description="Event #15" range="15" rwaccess="RO"/> 
		<bitfield id="E14" width="1" begin="14" end="14" resetval="0x0" description="Event #14" range="14" rwaccess="RO"/> 
		<bitfield id="E13" width="1" begin="13" end="13" resetval="0x0" description="Event #13" range="13" rwaccess="RO"/> 
		<bitfield id="E12" width="1" begin="12" end="12" resetval="0x0" description="Event #12" range="12" rwaccess="RO"/> 
		<bitfield id="E11" width="1" begin="11" end="11" resetval="0x0" description="Event #11" range="11" rwaccess="RO"/> 
		<bitfield id="E10" width="1" begin="10" end="10" resetval="0x0" description="Event #10" range="10" rwaccess="RO"/> 
		<bitfield id="E9" width="1" begin="9" end="9" resetval="0x0" description="Event #9" range="9" rwaccess="RO"/> 
		<bitfield id="E8" width="1" begin="8" end="8" resetval="0x0" description="Event #8" range="8" rwaccess="RO"/> 
		<bitfield id="E7" width="1" begin="7" end="7" resetval="0x0" description="Event #7" range="7" rwaccess="RO"/> 
		<bitfield id="E6" width="1" begin="6" end="6" resetval="0x0" description="Event #6" range="6" rwaccess="RO"/> 
		<bitfield id="E5" width="1" begin="5" end="5" resetval="0x0" description="Event #5" range="5" rwaccess="RO"/> 
		<bitfield id="E4" width="1" begin="4" end="4" resetval="0x0" description="Event #4" range="4" rwaccess="RO"/> 
		<bitfield id="E3" width="1" begin="3" end="3" resetval="0x0" description="Event #3" range="3" rwaccess="RO"/> 
		<bitfield id="E2" width="1" begin="2" end="2" resetval="0x0" description="Event #2" range="2" rwaccess="RO"/> 
		<bitfield id="E1" width="1" begin="1" end="1" resetval="0x0" description="Event #1" range="1" rwaccess="RO"/> 
		<bitfield id="E0" width="1" begin="0" end="0" resetval="0x0" description="Event #0" range="0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_ERH" acronym="TPCC0_ERH" offset="0x1004" width="32" description="">
		<bitfield id="E63" width="1" begin="31" end="31" resetval="0x0" description="Event #63" range="31" rwaccess="RO"/> 
		<bitfield id="E62" width="1" begin="30" end="30" resetval="0x0" description="Event #62" range="30" rwaccess="RO"/> 
		<bitfield id="E61" width="1" begin="29" end="29" resetval="0x0" description="Event #61" range="29" rwaccess="RO"/> 
		<bitfield id="E60" width="1" begin="28" end="28" resetval="0x0" description="Event #60" range="28" rwaccess="RO"/> 
		<bitfield id="E59" width="1" begin="27" end="27" resetval="0x0" description="Event #59" range="27" rwaccess="RO"/> 
		<bitfield id="E58" width="1" begin="26" end="26" resetval="0x0" description="Event #58" range="26" rwaccess="RO"/> 
		<bitfield id="E57" width="1" begin="25" end="25" resetval="0x0" description="Event #57" range="25" rwaccess="RO"/> 
		<bitfield id="E56" width="1" begin="24" end="24" resetval="0x0" description="Event #56" range="24" rwaccess="RO"/> 
		<bitfield id="E55" width="1" begin="23" end="23" resetval="0x0" description="Event #55" range="23" rwaccess="RO"/> 
		<bitfield id="E54" width="1" begin="22" end="22" resetval="0x0" description="Event #54" range="22" rwaccess="RO"/> 
		<bitfield id="E53" width="1" begin="21" end="21" resetval="0x0" description="Event #53" range="21" rwaccess="RO"/> 
		<bitfield id="E52" width="1" begin="20" end="20" resetval="0x0" description="Event #52" range="20" rwaccess="RO"/> 
		<bitfield id="E51" width="1" begin="19" end="19" resetval="0x0" description="Event #51" range="19" rwaccess="RO"/> 
		<bitfield id="E50" width="1" begin="18" end="18" resetval="0x0" description="Event #50" range="18" rwaccess="RO"/> 
		<bitfield id="E49" width="1" begin="17" end="17" resetval="0x0" description="Event #49" range="17" rwaccess="RO"/> 
		<bitfield id="E48" width="1" begin="16" end="16" resetval="0x0" description="Event #48" range="16" rwaccess="RO"/> 
		<bitfield id="E47" width="1" begin="15" end="15" resetval="0x0" description="Event #47" range="15" rwaccess="RO"/> 
		<bitfield id="E46" width="1" begin="14" end="14" resetval="0x0" description="Event #46" range="14" rwaccess="RO"/> 
		<bitfield id="E45" width="1" begin="13" end="13" resetval="0x0" description="Event #45" range="13" rwaccess="RO"/> 
		<bitfield id="E44" width="1" begin="12" end="12" resetval="0x0" description="Event #44" range="12" rwaccess="RO"/> 
		<bitfield id="E43" width="1" begin="11" end="11" resetval="0x0" description="Event #43" range="11" rwaccess="RO"/> 
		<bitfield id="E42" width="1" begin="10" end="10" resetval="0x0" description="Event #42" range="10" rwaccess="RO"/> 
		<bitfield id="E41" width="1" begin="9" end="9" resetval="0x0" description="Event #41" range="9" rwaccess="RO"/> 
		<bitfield id="E40" width="1" begin="8" end="8" resetval="0x0" description="Event #40" range="8" rwaccess="RO"/> 
		<bitfield id="E39" width="1" begin="7" end="7" resetval="0x0" description="Event #39" range="7" rwaccess="RO"/> 
		<bitfield id="E38" width="1" begin="6" end="6" resetval="0x0" description="Event #38" range="6" rwaccess="RO"/> 
		<bitfield id="E37" width="1" begin="5" end="5" resetval="0x0" description="Event #37" range="5" rwaccess="RO"/> 
		<bitfield id="E36" width="1" begin="4" end="4" resetval="0x0" description="Event #36" range="4" rwaccess="RO"/> 
		<bitfield id="E35" width="1" begin="3" end="3" resetval="0x0" description="Event #35" range="3" rwaccess="RO"/> 
		<bitfield id="E34" width="1" begin="2" end="2" resetval="0x0" description="Event #34" range="2" rwaccess="RO"/> 
		<bitfield id="E33" width="1" begin="1" end="1" resetval="0x0" description="Event #33" range="1" rwaccess="RO"/> 
		<bitfield id="E32" width="1" begin="0" end="0" resetval="0x0" description="Event #32" range="0" rwaccess="RO"/>
	</register>
