IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TPCC0_TPCC0.xml
	<register id="TPCC0_IPR" acronym="TPCC0_IPR" offset="0x1068" width="32" description="">
		<bitfield id="I31" width="1" begin="31" end="31" resetval="0x0" description="Interrupt associated with TCC #31" range="31" rwaccess="RO"/> 
		<bitfield id="I30" width="1" begin="30" end="30" resetval="0x0" description="Interrupt associated with TCC #30" range="30" rwaccess="RO"/> 
		<bitfield id="I29" width="1" begin="29" end="29" resetval="0x0" description="Interrupt associated with TCC #29" range="29" rwaccess="RO"/> 
		<bitfield id="I28" width="1" begin="28" end="28" resetval="0x0" description="Interrupt associated with TCC #28" range="28" rwaccess="RO"/> 
		<bitfield id="I27" width="1" begin="27" end="27" resetval="0x0" description="Interrupt associated with TCC #27" range="27" rwaccess="RO"/> 
		<bitfield id="I26" width="1" begin="26" end="26" resetval="0x0" description="Interrupt associated with TCC #26" range="26" rwaccess="RO"/> 
		<bitfield id="I25" width="1" begin="25" end="25" resetval="0x0" description="Interrupt associated with TCC #25" range="25" rwaccess="RO"/> 
		<bitfield id="I24" width="1" begin="24" end="24" resetval="0x0" description="Interrupt associated with TCC #24" range="24" rwaccess="RO"/> 
		<bitfield id="I23" width="1" begin="23" end="23" resetval="0x0" description="Interrupt associated with TCC #23" range="23" rwaccess="RO"/> 
		<bitfield id="I22" width="1" begin="22" end="22" resetval="0x0" description="Interrupt associated with TCC #22" range="22" rwaccess="RO"/> 
		<bitfield id="I21" width="1" begin="21" end="21" resetval="0x0" description="Interrupt associated with TCC #21" range="21" rwaccess="RO"/> 
		<bitfield id="I20" width="1" begin="20" end="20" resetval="0x0" description="Interrupt associated with TCC #20" range="20" rwaccess="RO"/> 
		<bitfield id="I19" width="1" begin="19" end="19" resetval="0x0" description="Interrupt associated with TCC #19" range="19" rwaccess="RO"/> 
		<bitfield id="I18" width="1" begin="18" end="18" resetval="0x0" description="Interrupt associated with TCC #18" range="18" rwaccess="RO"/> 
		<bitfield id="I17" width="1" begin="17" end="17" resetval="0x0" description="Interrupt associated with TCC #17" range="17" rwaccess="RO"/> 
		<bitfield id="I16" width="1" begin="16" end="16" resetval="0x0" description="Interrupt associated with TCC #16" range="16" rwaccess="RO"/> 
		<bitfield id="I15" width="1" begin="15" end="15" resetval="0x0" description="Interrupt associated with TCC #15" range="15" rwaccess="RO"/> 
		<bitfield id="I14" width="1" begin="14" end="14" resetval="0x0" description="Interrupt associated with TCC #14" range="14" rwaccess="RO"/> 
		<bitfield id="I13" width="1" begin="13" end="13" resetval="0x0" description="Interrupt associated with TCC #13" range="13" rwaccess="RO"/> 
		<bitfield id="I12" width="1" begin="12" end="12" resetval="0x0" description="Interrupt associated with TCC #12" range="12" rwaccess="RO"/> 
		<bitfield id="I11" width="1" begin="11" end="11" resetval="0x0" description="Interrupt associated with TCC #11" range="11" rwaccess="RO"/> 
		<bitfield id="I10" width="1" begin="10" end="10" resetval="0x0" description="Interrupt associated with TCC #10" range="10" rwaccess="RO"/> 
		<bitfield id="I9" width="1" begin="9" end="9" resetval="0x0" description="Interrupt associated with TCC #9" range="9" rwaccess="RO"/> 
		<bitfield id="I8" width="1" begin="8" end="8" resetval="0x0" description="Interrupt associated with TCC #8" range="8" rwaccess="RO"/> 
		<bitfield id="I7" width="1" begin="7" end="7" resetval="0x0" description="Interrupt associated with TCC #7" range="7" rwaccess="RO"/> 
		<bitfield id="I6" width="1" begin="6" end="6" resetval="0x0" description="Interrupt associated with TCC #6" range="6" rwaccess="RO"/> 
		<bitfield id="I5" width="1" begin="5" end="5" resetval="0x0" description="Interrupt associated with TCC #5" range="5" rwaccess="RO"/> 
		<bitfield id="I4" width="1" begin="4" end="4" resetval="0x0" description="Interrupt associated with TCC #4" range="4" rwaccess="RO"/> 
		<bitfield id="I3" width="1" begin="3" end="3" resetval="0x0" description="Interrupt associated with TCC #3" range="3" rwaccess="RO"/> 
		<bitfield id="I2" width="1" begin="2" end="2" resetval="0x0" description="Interrupt associated with TCC #2" range="2" rwaccess="RO"/> 
		<bitfield id="I1" width="1" begin="1" end="1" resetval="0x0" description="Interrupt associated with TCC #1" range="1" rwaccess="RO"/> 
		<bitfield id="I0" width="1" begin="0" end="0" resetval="0x0" description="Interrupt associated with TCC #0" range="0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_IPRH" acronym="TPCC0_IPRH" offset="0x106C" width="32" description="">
		<bitfield id="I63" width="1" begin="31" end="31" resetval="0x0" description="Interrupt associated with TCC #63" range="31" rwaccess="RO"/> 
		<bitfield id="I62" width="1" begin="30" end="30" resetval="0x0" description="Interrupt associated with TCC #62" range="30" rwaccess="RO"/> 
		<bitfield id="I61" width="1" begin="29" end="29" resetval="0x0" description="Interrupt associated with TCC #61" range="29" rwaccess="RO"/> 
		<bitfield id="I60" width="1" begin="28" end="28" resetval="0x0" description="Interrupt associated with TCC #60" range="28" rwaccess="RO"/> 
		<bitfield id="I59" width="1" begin="27" end="27" resetval="0x0" description="Interrupt associated with TCC #59" range="27" rwaccess="RO"/> 
		<bitfield id="I58" width="1" begin="26" end="26" resetval="0x0" description="Interrupt associated with TCC #58" range="26" rwaccess="RO"/> 
		<bitfield id="I57" width="1" begin="25" end="25" resetval="0x0" description="Interrupt associated with TCC #57" range="25" rwaccess="RO"/> 
		<bitfield id="I56" width="1" begin="24" end="24" resetval="0x0" description="Interrupt associated with TCC #56" range="24" rwaccess="RO"/> 
		<bitfield id="I55" width="1" begin="23" end="23" resetval="0x0" description="Interrupt associated with TCC #55" range="23" rwaccess="RO"/> 
		<bitfield id="I54" width="1" begin="22" end="22" resetval="0x0" description="Interrupt associated with TCC #54" range="22" rwaccess="RO"/> 
		<bitfield id="I53" width="1" begin="21" end="21" resetval="0x0" description="Interrupt associated with TCC #53" range="21" rwaccess="RO"/> 
		<bitfield id="I52" width="1" begin="20" end="20" resetval="0x0" description="Interrupt associated with TCC #52" range="20" rwaccess="RO"/> 
		<bitfield id="I51" width="1" begin="19" end="19" resetval="0x0" description="Interrupt associated with TCC #51" range="19" rwaccess="RO"/> 
		<bitfield id="I50" width="1" begin="18" end="18" resetval="0x0" description="Interrupt associated with TCC #50" range="18" rwaccess="RO"/> 
		<bitfield id="I49" width="1" begin="17" end="17" resetval="0x0" description="Interrupt associated with TCC #49" range="17" rwaccess="RO"/> 
		<bitfield id="I48" width="1" begin="16" end="16" resetval="0x0" description="Interrupt associated with TCC #48" range="16" rwaccess="RO"/> 
		<bitfield id="I47" width="1" begin="15" end="15" resetval="0x0" description="Interrupt associated with TCC #47" range="15" rwaccess="RO"/> 
		<bitfield id="I46" width="1" begin="14" end="14" resetval="0x0" description="Interrupt associated with TCC #46" range="14" rwaccess="RO"/> 
		<bitfield id="I45" width="1" begin="13" end="13" resetval="0x0" description="Interrupt associated with TCC #45" range="13" rwaccess="RO"/> 
		<bitfield id="I44" width="1" begin="12" end="12" resetval="0x0" description="Interrupt associated with TCC #44" range="12" rwaccess="RO"/> 
		<bitfield id="I43" width="1" begin="11" end="11" resetval="0x0" description="Interrupt associated with TCC #43" range="11" rwaccess="RO"/> 
		<bitfield id="I42" width="1" begin="10" end="10" resetval="0x0" description="Interrupt associated with TCC #42" range="10" rwaccess="RO"/> 
		<bitfield id="I41" width="1" begin="9" end="9" resetval="0x0" description="Interrupt associated with TCC #41" range="9" rwaccess="RO"/> 
		<bitfield id="I40" width="1" begin="8" end="8" resetval="0x0" description="Interrupt associated with TCC #40" range="8" rwaccess="RO"/> 
		<bitfield id="I39" width="1" begin="7" end="7" resetval="0x0" description="Interrupt associated with TCC #39" range="7" rwaccess="RO"/> 
		<bitfield id="I38" width="1" begin="6" end="6" resetval="0x0" description="Interrupt associated with TCC #38" range="6" rwaccess="RO"/> 
		<bitfield id="I37" width="1" begin="5" end="5" resetval="0x0" description="Interrupt associated with TCC #37" range="5" rwaccess="RO"/> 
		<bitfield id="I36" width="1" begin="4" end="4" resetval="0x0" description="Interrupt associated with TCC #36" range="4" rwaccess="RO"/> 
		<bitfield id="I35" width="1" begin="3" end="3" resetval="0x0" description="Interrupt associated with TCC #35" range="3" rwaccess="RO"/> 
		<bitfield id="I34" width="1" begin="2" end="2" resetval="0x0" description="Interrupt associated with TCC #34" range="2" rwaccess="RO"/> 
		<bitfield id="I33" width="1" begin="1" end="1" resetval="0x0" description="Interrupt associated with TCC #33" range="1" rwaccess="RO"/> 
		<bitfield id="I32" width="1" begin="0" end="0" resetval="0x0" description="Interrupt associated with TCC #32" range="0" rwaccess="RO"/>
	</register>
