IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TPCC0_TPCC0.xml
	<register id="TPCC0_QEESR" acronym="TPCC0_QEESR" offset="0x108C" width="32" description="">
		<bitfield id="RES73" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="E7" width="1" begin="7" end="7" resetval="0x0" description="Event #7" range="7" rwaccess="WO"/> 
		<bitfield id="E6" width="1" begin="6" end="6" resetval="0x0" description="Event #6" range="6" rwaccess="WO"/> 
		<bitfield id="E5" width="1" begin="5" end="5" resetval="0x0" description="Event #5" range="5" rwaccess="WO"/> 
		<bitfield id="E4" width="1" begin="4" end="4" resetval="0x0" description="Event #4" range="4" rwaccess="WO"/> 
		<bitfield id="E3" width="1" begin="3" end="3" resetval="0x0" description="Event #3" range="3" rwaccess="WO"/> 
		<bitfield id="E2" width="1" begin="2" end="2" resetval="0x0" description="Event #2" range="2" rwaccess="WO"/> 
		<bitfield id="E1" width="1" begin="1" end="1" resetval="0x0" description="Event #1" range="1" rwaccess="WO"/> 
		<bitfield id="E0" width="1" begin="0" end="0" resetval="0x0" description="Event #0" range="0" rwaccess="WO"/>
	</register>
	<register id="TPCC0_QSER" acronym="TPCC0_QSER" offset="0x1090" width="32" description="">
		<bitfield id="RES74" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="E7" width="1" begin="7" end="7" resetval="0x0" description="Event #7" range="7" rwaccess="RO"/> 
		<bitfield id="E6" width="1" begin="6" end="6" resetval="0x0" description="Event #6" range="6" rwaccess="RO"/> 
		<bitfield id="E5" width="1" begin="5" end="5" resetval="0x0" description="Event #5" range="5" rwaccess="RO"/> 
		<bitfield id="E4" width="1" begin="4" end="4" resetval="0x0" description="Event #4" range="4" rwaccess="RO"/> 
		<bitfield id="E3" width="1" begin="3" end="3" resetval="0x0" description="Event #3" range="3" rwaccess="RO"/> 
		<bitfield id="E2" width="1" begin="2" end="2" resetval="0x0" description="Event #2" range="2" rwaccess="RO"/> 
		<bitfield id="E1" width="1" begin="1" end="1" resetval="0x0" description="Event #1" range="1" rwaccess="RO"/> 
		<bitfield id="E0" width="1" begin="0" end="0" resetval="0x0" description="Event #0" range="0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QSECR" acronym="TPCC0_QSECR" offset="0x1094" width="32" description="">
		<bitfield id="RES75" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="E7" width="1" begin="7" end="7" resetval="0x0" description="Event #7" range="7" rwaccess="WO"/> 
		<bitfield id="E6" width="1" begin="6" end="6" resetval="0x0" description="Event #6" range="6" rwaccess="WO"/> 
		<bitfield id="E5" width="1" begin="5" end="5" resetval="0x0" description="Event #5" range="5" rwaccess="WO"/> 
		<bitfield id="E4" width="1" begin="4" end="4" resetval="0x0" description="Event #4" range="4" rwaccess="WO"/> 
		<bitfield id="E3" width="1" begin="3" end="3" resetval="0x0" description="Event #3" range="3" rwaccess="WO"/> 
		<bitfield id="E2" width="1" begin="2" end="2" resetval="0x0" description="Event #2" range="2" rwaccess="WO"/> 
		<bitfield id="E1" width="1" begin="1" end="1" resetval="0x0" description="Event #1" range="1" rwaccess="WO"/> 
		<bitfield id="E0" width="1" begin="0" end="0" resetval="0x0" description="Event #0" range="0" rwaccess="WO"/>
	</register>
	<register id="TPCC0_ER_RN" acronym="TPCC0_ER_RN" offset="0x2000" width="32" description="">
		<bitfield id="E31" width="1" begin="31" end="31" resetval="0x0" description="Event #31" range="31" rwaccess="RO"/> 
		<bitfield id="E30" width="1" begin="30" end="30" resetval="0x0" description="Event #30" range="30" rwaccess="RO"/> 
		<bitfield id="E29" width="1" begin="29" end="29" resetval="0x0" description="Event #29" range="29" rwaccess="RO"/> 
		<bitfield id="E28" width="1" begin="28" end="28" resetval="0x0" description="Event #28" range="28" rwaccess="RO"/> 
		<bitfield id="E27" width="1" begin="27" end="27" resetval="0x0" description="Event #27" range="27" rwaccess="RO"/> 
		<bitfield id="E26" width="1" begin="26" end="26" resetval="0x0" description="Event #26" range="26" rwaccess="RO"/> 
		<bitfield id="E25" width="1" begin="25" end="25" resetval="0x0" description="Event #25" range="25" rwaccess="RO"/> 
		<bitfield id="E24" width="1" begin="24" end="24" resetval="0x0" description="Event #24" range="24" rwaccess="RO"/> 
		<bitfield id="E23" width="1" begin="23" end="23" resetval="0x0" description="Event #23" range="23" rwaccess="RO"/> 
		<bitfield id="E22" width="1" begin="22" end="22" resetval="0x0" description="Event #22" range="22" rwaccess="RO"/> 
		<bitfield id="E21" width="1" begin="21" end="21" resetval="0x0" description="Event #21" range="21" rwaccess="RO"/> 
		<bitfield id="E20" width="1" begin="20" end="20" resetval="0x0" description="Event #20" range="20" rwaccess="RO"/> 
		<bitfield id="E19" width="1" begin="19" end="19" resetval="0x0" description="Event #19" range="19" rwaccess="RO"/> 
		<bitfield id="E18" width="1" begin="18" end="18" resetval="0x0" description="Event #18" range="18" rwaccess="RO"/> 
		<bitfield id="E17" width="1" begin="17" end="17" resetval="0x0" description="Event #17" range="17" rwaccess="RO"/> 
		<bitfield id="E16" width="1" begin="16" end="16" resetval="0x0" description="Event #16" range="16" rwaccess="RO"/> 
		<bitfield id="E15" width="1" begin="15" end="15" resetval="0x0" description="Event #15" range="15" rwaccess="RO"/> 
		<bitfield id="E14" width="1" begin="14" end="14" resetval="0x0" description="Event #14" range="14" rwaccess="RO"/> 
		<bitfield id="E13" width="1" begin="13" end="13" resetval="0x0" description="Event #13" range="13" rwaccess="RO"/> 
		<bitfield id="E12" width="1" begin="12" end="12" resetval="0x0" description="Event #12" range="12" rwaccess="RO"/> 
		<bitfield id="E11" width="1" begin="11" end="11" resetval="0x0" description="Event #11" range="11" rwaccess="RO"/> 
		<bitfield id="E10" width="1" begin="10" end="10" resetval="0x0" description="Event #10" range="10" rwaccess="RO"/> 
		<bitfield id="E9" width="1" begin="9" end="9" resetval="0x0" description="Event #9" range="9" rwaccess="RO"/> 
		<bitfield id="E8" width="1" begin="8" end="8" resetval="0x0" description="Event #8" range="8" rwaccess="RO"/> 
		<bitfield id="E7" width="1" begin="7" end="7" resetval="0x0" description="Event #7" range="7" rwaccess="RO"/> 
		<bitfield id="E6" width="1" begin="6" end="6" resetval="0x0" description="Event #6" range="6" rwaccess="RO"/> 
		<bitfield id="E5" width="1" begin="5" end="5" resetval="0x0" description="Event #5" range="5" rwaccess="RO"/> 
		<bitfield id="E4" width="1" begin="4" end="4" resetval="0x0" description="Event #4" range="4" rwaccess="RO"/> 
		<bitfield id="E3" width="1" begin="3" end="3" resetval="0x0" description="Event #3" range="3" rwaccess="RO"/> 
		<bitfield id="E2" width="1" begin="2" end="2" resetval="0x0" description="Event #2" range="2" rwaccess="RO"/> 
		<bitfield id="E1" width="1" begin="1" end="1" resetval="0x0" description="Event #1" range="1" rwaccess="RO"/> 
		<bitfield id="E0" width="1" begin="0" end="0" resetval="0x0" description="Event #0" range="0" rwaccess="RO"/>
	</register>
