IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TPCC0_TPCC0.xml
	<register id="TPCC0_SERH_RN" acronym="TPCC0_SERH_RN" offset="0x203C" width="32" description="">
		<bitfield id="E63" width="1" begin="31" end="31" resetval="0x0" description="Event #63" range="31" rwaccess="RO"/> 
		<bitfield id="E62" width="1" begin="30" end="30" resetval="0x0" description="Event #62" range="30" rwaccess="RO"/> 
		<bitfield id="E61" width="1" begin="29" end="29" resetval="0x0" description="Event #61" range="29" rwaccess="RO"/> 
		<bitfield id="E60" width="1" begin="28" end="28" resetval="0x0" description="Event #60" range="28" rwaccess="RO"/> 
		<bitfield id="E59" width="1" begin="27" end="27" resetval="0x0" description="Event #59" range="27" rwaccess="RO"/> 
		<bitfield id="E58" width="1" begin="26" end="26" resetval="0x0" description="Event #58" range="26" rwaccess="RO"/> 
		<bitfield id="E57" width="1" begin="25" end="25" resetval="0x0" description="Event #57" range="25" rwaccess="RO"/> 
		<bitfield id="E56" width="1" begin="24" end="24" resetval="0x0" description="Event #56" range="24" rwaccess="RO"/> 
		<bitfield id="E55" width="1" begin="23" end="23" resetval="0x0" description="Event #55" range="23" rwaccess="RO"/> 
		<bitfield id="E54" width="1" begin="22" end="22" resetval="0x0" description="Event #54" range="22" rwaccess="RO"/> 
		<bitfield id="E53" width="1" begin="21" end="21" resetval="0x0" description="Event #53" range="21" rwaccess="RO"/> 
		<bitfield id="E52" width="1" begin="20" end="20" resetval="0x0" description="Event #52" range="20" rwaccess="RO"/> 
		<bitfield id="E51" width="1" begin="19" end="19" resetval="0x0" description="Event #51" range="19" rwaccess="RO"/> 
		<bitfield id="E50" width="1" begin="18" end="18" resetval="0x0" description="Event #50" range="18" rwaccess="RO"/> 
		<bitfield id="E49" width="1" begin="17" end="17" resetval="0x0" description="Event #49" range="17" rwaccess="RO"/> 
		<bitfield id="E48" width="1" begin="16" end="16" resetval="0x0" description="Event #48" range="16" rwaccess="RO"/> 
		<bitfield id="E47" width="1" begin="15" end="15" resetval="0x0" description="Event #47" range="15" rwaccess="RO"/> 
		<bitfield id="E46" width="1" begin="14" end="14" resetval="0x0" description="Event #46" range="14" rwaccess="RO"/> 
		<bitfield id="E45" width="1" begin="13" end="13" resetval="0x0" description="Event #45" range="13" rwaccess="RO"/> 
		<bitfield id="E44" width="1" begin="12" end="12" resetval="0x0" description="Event #44" range="12" rwaccess="RO"/> 
		<bitfield id="E43" width="1" begin="11" end="11" resetval="0x0" description="Event #43" range="11" rwaccess="RO"/> 
		<bitfield id="E42" width="1" begin="10" end="10" resetval="0x0" description="Event #42" range="10" rwaccess="RO"/> 
		<bitfield id="E41" width="1" begin="9" end="9" resetval="0x0" description="Event #41" range="9" rwaccess="RO"/> 
		<bitfield id="E40" width="1" begin="8" end="8" resetval="0x0" description="Event #40" range="8" rwaccess="RO"/> 
		<bitfield id="E39" width="1" begin="7" end="7" resetval="0x0" description="Event #39" range="7" rwaccess="RO"/> 
		<bitfield id="E38" width="1" begin="6" end="6" resetval="0x0" description="Event #38" range="6" rwaccess="RO"/> 
		<bitfield id="E37" width="1" begin="5" end="5" resetval="0x0" description="Event #37" range="5" rwaccess="RO"/> 
		<bitfield id="E36" width="1" begin="4" end="4" resetval="0x0" description="Event #36" range="4" rwaccess="RO"/> 
		<bitfield id="E35" width="1" begin="3" end="3" resetval="0x0" description="Event #35" range="3" rwaccess="RO"/> 
		<bitfield id="E34" width="1" begin="2" end="2" resetval="0x0" description="Event #34" range="2" rwaccess="RO"/> 
		<bitfield id="E33" width="1" begin="1" end="1" resetval="0x0" description="Event #33" range="1" rwaccess="RO"/> 
		<bitfield id="E32" width="1" begin="0" end="0" resetval="0x0" description="Event #32" range="0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_SECR_RN" acronym="TPCC0_SECR_RN" offset="0x2040" width="32" description="">
		<bitfield id="E31" width="1" begin="31" end="31" resetval="0x0" description="Event #31" range="31" rwaccess="WO"/> 
		<bitfield id="E30" width="1" begin="30" end="30" resetval="0x0" description="Event #30" range="30" rwaccess="WO"/> 
		<bitfield id="E29" width="1" begin="29" end="29" resetval="0x0" description="Event #29" range="29" rwaccess="WO"/> 
		<bitfield id="E28" width="1" begin="28" end="28" resetval="0x0" description="Event #28" range="28" rwaccess="WO"/> 
		<bitfield id="E27" width="1" begin="27" end="27" resetval="0x0" description="Event #27" range="27" rwaccess="WO"/> 
		<bitfield id="E26" width="1" begin="26" end="26" resetval="0x0" description="Event #26" range="26" rwaccess="WO"/> 
		<bitfield id="E25" width="1" begin="25" end="25" resetval="0x0" description="Event #25" range="25" rwaccess="WO"/> 
		<bitfield id="E24" width="1" begin="24" end="24" resetval="0x0" description="Event #24" range="24" rwaccess="WO"/> 
		<bitfield id="E23" width="1" begin="23" end="23" resetval="0x0" description="Event #23" range="23" rwaccess="WO"/> 
		<bitfield id="E22" width="1" begin="22" end="22" resetval="0x0" description="Event #22" range="22" rwaccess="WO"/> 
		<bitfield id="E21" width="1" begin="21" end="21" resetval="0x0" description="Event #21" range="21" rwaccess="WO"/> 
		<bitfield id="E20" width="1" begin="20" end="20" resetval="0x0" description="Event #20" range="20" rwaccess="WO"/> 
		<bitfield id="E19" width="1" begin="19" end="19" resetval="0x0" description="Event #19" range="19" rwaccess="WO"/> 
		<bitfield id="E18" width="1" begin="18" end="18" resetval="0x0" description="Event #18" range="18" rwaccess="WO"/> 
		<bitfield id="E17" width="1" begin="17" end="17" resetval="0x0" description="Event #17" range="17" rwaccess="WO"/> 
		<bitfield id="E16" width="1" begin="16" end="16" resetval="0x0" description="Event #16" range="16" rwaccess="WO"/> 
		<bitfield id="E15" width="1" begin="15" end="15" resetval="0x0" description="Event #15" range="15" rwaccess="WO"/> 
		<bitfield id="E14" width="1" begin="14" end="14" resetval="0x0" description="Event #14" range="14" rwaccess="WO"/> 
		<bitfield id="E13" width="1" begin="13" end="13" resetval="0x0" description="Event #13" range="13" rwaccess="WO"/> 
		<bitfield id="E12" width="1" begin="12" end="12" resetval="0x0" description="Event #12" range="12" rwaccess="WO"/> 
		<bitfield id="E11" width="1" begin="11" end="11" resetval="0x0" description="Event #11" range="11" rwaccess="WO"/> 
		<bitfield id="E10" width="1" begin="10" end="10" resetval="0x0" description="Event #10" range="10" rwaccess="WO"/> 
		<bitfield id="E9" width="1" begin="9" end="9" resetval="0x0" description="Event #9" range="9" rwaccess="WO"/> 
		<bitfield id="E8" width="1" begin="8" end="8" resetval="0x0" description="Event #8" range="8" rwaccess="WO"/> 
		<bitfield id="E7" width="1" begin="7" end="7" resetval="0x0" description="Event #7" range="7" rwaccess="WO"/> 
		<bitfield id="E6" width="1" begin="6" end="6" resetval="0x0" description="Event #6" range="6" rwaccess="WO"/> 
		<bitfield id="E5" width="1" begin="5" end="5" resetval="0x0" description="Event #5" range="5" rwaccess="WO"/> 
		<bitfield id="E4" width="1" begin="4" end="4" resetval="0x0" description="Event #4" range="4" rwaccess="WO"/> 
		<bitfield id="E3" width="1" begin="3" end="3" resetval="0x0" description="Event #3" range="3" rwaccess="WO"/> 
		<bitfield id="E2" width="1" begin="2" end="2" resetval="0x0" description="Event #2" range="2" rwaccess="WO"/> 
		<bitfield id="E1" width="1" begin="1" end="1" resetval="0x0" description="Event #1" range="1" rwaccess="WO"/> 
		<bitfield id="E0" width="1" begin="0" end="0" resetval="0x0" description="Event #0" range="0" rwaccess="WO"/>
	</register>
	<register id="TPCC0_SECRH_RN" acronym="TPCC0_SECRH_RN" offset="0x2044" width="32" description="">
		<bitfield id="E63" width="1" begin="31" end="31" resetval="0x0" description="Event #63" range="31" rwaccess="WO"/> 
		<bitfield id="E62" width="1" begin="30" end="30" resetval="0x0" description="Event #62" range="30" rwaccess="WO"/> 
		<bitfield id="E61" width="1" begin="29" end="29" resetval="0x0" description="Event #61" range="29" rwaccess="WO"/> 
		<bitfield id="E60" width="1" begin="28" end="28" resetval="0x0" description="Event #60" range="28" rwaccess="WO"/> 
		<bitfield id="E59" width="1" begin="27" end="27" resetval="0x0" description="Event #59" range="27" rwaccess="WO"/> 
		<bitfield id="E58" width="1" begin="26" end="26" resetval="0x0" description="Event #58" range="26" rwaccess="WO"/> 
		<bitfield id="E57" width="1" begin="25" end="25" resetval="0x0" description="Event #57" range="25" rwaccess="WO"/> 
		<bitfield id="E56" width="1" begin="24" end="24" resetval="0x0" description="Event #56" range="24" rwaccess="WO"/> 
		<bitfield id="E55" width="1" begin="23" end="23" resetval="0x0" description="Event #55" range="23" rwaccess="WO"/> 
		<bitfield id="E54" width="1" begin="22" end="22" resetval="0x0" description="Event #54" range="22" rwaccess="WO"/> 
		<bitfield id="E53" width="1" begin="21" end="21" resetval="0x0" description="Event #53" range="21" rwaccess="WO"/> 
		<bitfield id="E52" width="1" begin="20" end="20" resetval="0x0" description="Event #52" range="20" rwaccess="WO"/> 
		<bitfield id="E51" width="1" begin="19" end="19" resetval="0x0" description="Event #51" range="19" rwaccess="WO"/> 
		<bitfield id="E50" width="1" begin="18" end="18" resetval="0x0" description="Event #50" range="18" rwaccess="WO"/> 
		<bitfield id="E49" width="1" begin="17" end="17" resetval="0x0" description="Event #49" range="17" rwaccess="WO"/> 
		<bitfield id="E48" width="1" begin="16" end="16" resetval="0x0" description="Event #48" range="16" rwaccess="WO"/> 
		<bitfield id="E47" width="1" begin="15" end="15" resetval="0x0" description="Event #47" range="15" rwaccess="WO"/> 
		<bitfield id="E46" width="1" begin="14" end="14" resetval="0x0" description="Event #46" range="14" rwaccess="WO"/> 
		<bitfield id="E45" width="1" begin="13" end="13" resetval="0x0" description="Event #45" range="13" rwaccess="WO"/> 
		<bitfield id="E44" width="1" begin="12" end="12" resetval="0x0" description="Event #44" range="12" rwaccess="WO"/> 
		<bitfield id="E43" width="1" begin="11" end="11" resetval="0x0" description="Event #43" range="11" rwaccess="WO"/> 
		<bitfield id="E42" width="1" begin="10" end="10" resetval="0x0" description="Event #42" range="10" rwaccess="WO"/> 
		<bitfield id="E41" width="1" begin="9" end="9" resetval="0x0" description="Event #41" range="9" rwaccess="WO"/> 
		<bitfield id="E40" width="1" begin="8" end="8" resetval="0x0" description="Event #40" range="8" rwaccess="WO"/> 
		<bitfield id="E39" width="1" begin="7" end="7" resetval="0x0" description="Event #39" range="7" rwaccess="WO"/> 
		<bitfield id="E38" width="1" begin="6" end="6" resetval="0x0" description="Event #38" range="6" rwaccess="WO"/> 
		<bitfield id="E37" width="1" begin="5" end="5" resetval="0x0" description="Event #37" range="5" rwaccess="WO"/> 
		<bitfield id="E36" width="1" begin="4" end="4" resetval="0x0" description="Event #36" range="4" rwaccess="WO"/> 
		<bitfield id="E35" width="1" begin="3" end="3" resetval="0x0" description="Event #35" range="3" rwaccess="WO"/> 
		<bitfield id="E34" width="1" begin="2" end="2" resetval="0x0" description="Event #34" range="2" rwaccess="WO"/> 
		<bitfield id="E33" width="1" begin="1" end="1" resetval="0x0" description="Event #33" range="1" rwaccess="WO"/> 
		<bitfield id="E32" width="1" begin="0" end="0" resetval="0x0" description="Event #32" range="0" rwaccess="WO"/>
	</register>
	<register id="TPCC0_IER_RN" acronym="TPCC0_IER_RN" offset="0x2050" width="32" description="">
		<bitfield id="I31" width="1" begin="31" end="31" resetval="0x0" description="Interrupt associated with TCC #31" range="31" rwaccess="RO"/> 
		<bitfield id="I30" width="1" begin="30" end="30" resetval="0x0" description="Interrupt associated with TCC #30" range="30" rwaccess="RO"/> 
		<bitfield id="I29" width="1" begin="29" end="29" resetval="0x0" description="Interrupt associated with TCC #29" range="29" rwaccess="RO"/> 
		<bitfield id="I28" width="1" begin="28" end="28" resetval="0x0" description="Interrupt associated with TCC #28" range="28" rwaccess="RO"/> 
		<bitfield id="I27" width="1" begin="27" end="27" resetval="0x0" description="Interrupt associated with TCC #27" range="27" rwaccess="RO"/> 
		<bitfield id="I26" width="1" begin="26" end="26" resetval="0x0" description="Interrupt associated with TCC #26" range="26" rwaccess="RO"/> 
		<bitfield id="I25" width="1" begin="25" end="25" resetval="0x0" description="Interrupt associated with TCC #25" range="25" rwaccess="RO"/> 
		<bitfield id="I24" width="1" begin="24" end="24" resetval="0x0" description="Interrupt associated with TCC #24" range="24" rwaccess="RO"/> 
		<bitfield id="I23" width="1" begin="23" end="23" resetval="0x0" description="Interrupt associated with TCC #23" range="23" rwaccess="RO"/> 
		<bitfield id="I22" width="1" begin="22" end="22" resetval="0x0" description="Interrupt associated with TCC #22" range="22" rwaccess="RO"/> 
		<bitfield id="I21" width="1" begin="21" end="21" resetval="0x0" description="Interrupt associated with TCC #21" range="21" rwaccess="RO"/> 
		<bitfield id="I20" width="1" begin="20" end="20" resetval="0x0" description="Interrupt associated with TCC #20" range="20" rwaccess="RO"/> 
		<bitfield id="I19" width="1" begin="19" end="19" resetval="0x0" description="Interrupt associated with TCC #19" range="19" rwaccess="RO"/> 
		<bitfield id="I18" width="1" begin="18" end="18" resetval="0x0" description="Interrupt associated with TCC #18" range="18" rwaccess="RO"/> 
		<bitfield id="I17" width="1" begin="17" end="17" resetval="0x0" description="Interrupt associated with TCC #17" range="17" rwaccess="RO"/> 
		<bitfield id="I16" width="1" begin="16" end="16" resetval="0x0" description="Interrupt associated with TCC #16" range="16" rwaccess="RO"/> 
		<bitfield id="I15" width="1" begin="15" end="15" resetval="0x0" description="Interrupt associated with TCC #15" range="15" rwaccess="RO"/> 
		<bitfield id="I14" width="1" begin="14" end="14" resetval="0x0" description="Interrupt associated with TCC #14" range="14" rwaccess="RO"/> 
		<bitfield id="I13" width="1" begin="13" end="13" resetval="0x0" description="Interrupt associated with TCC #13" range="13" rwaccess="RO"/> 
		<bitfield id="I12" width="1" begin="12" end="12" resetval="0x0" description="Interrupt associated with TCC #12" range="12" rwaccess="RO"/> 
		<bitfield id="I11" width="1" begin="11" end="11" resetval="0x0" description="Interrupt associated with TCC #11" range="11" rwaccess="RO"/> 
		<bitfield id="I10" width="1" begin="10" end="10" resetval="0x0" description="Interrupt associated with TCC #10" range="10" rwaccess="RO"/> 
		<bitfield id="I9" width="1" begin="9" end="9" resetval="0x0" description="Interrupt associated with TCC #9" range="9" rwaccess="RO"/> 
		<bitfield id="I8" width="1" begin="8" end="8" resetval="0x0" description="Interrupt associated with TCC #8" range="8" rwaccess="RO"/> 
		<bitfield id="I7" width="1" begin="7" end="7" resetval="0x0" description="Interrupt associated with TCC #7" range="7" rwaccess="RO"/> 
		<bitfield id="I6" width="1" begin="6" end="6" resetval="0x0" description="Interrupt associated with TCC #6" range="6" rwaccess="RO"/> 
		<bitfield id="I5" width="1" begin="5" end="5" resetval="0x0" description="Interrupt associated with TCC #5" range="5" rwaccess="RO"/> 
		<bitfield id="I4" width="1" begin="4" end="4" resetval="0x0" description="Interrupt associated with TCC #4" range="4" rwaccess="RO"/> 
		<bitfield id="I3" width="1" begin="3" end="3" resetval="0x0" description="Interrupt associated with TCC #3" range="3" rwaccess="RO"/> 
		<bitfield id="I2" width="1" begin="2" end="2" resetval="0x0" description="Interrupt associated with TCC #2" range="2" rwaccess="RO"/> 
		<bitfield id="I1" width="1" begin="1" end="1" resetval="0x0" description="Interrupt associated with TCC #1" range="1" rwaccess="RO"/> 
		<bitfield id="I0" width="1" begin="0" end="0" resetval="0x0" description="Interrupt associated with TCC #0" range="0" rwaccess="RO"/>
	</register>
