IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TPCC0_TPCC0.xml
	<register id="TPCC0_QEESR_RN" acronym="TPCC0_QEESR_RN" offset="0x208C" width="32" description="">
		<bitfield id="RES80" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="E7" width="1" begin="7" end="7" resetval="0x0" description="Event #7" range="7" rwaccess="WO"/> 
		<bitfield id="E6" width="1" begin="6" end="6" resetval="0x0" description="Event #6" range="6" rwaccess="WO"/> 
		<bitfield id="E5" width="1" begin="5" end="5" resetval="0x0" description="Event #5" range="5" rwaccess="WO"/> 
		<bitfield id="E4" width="1" begin="4" end="4" resetval="0x0" description="Event #4" range="4" rwaccess="WO"/> 
		<bitfield id="E3" width="1" begin="3" end="3" resetval="0x0" description="Event #3" range="3" rwaccess="WO"/> 
		<bitfield id="E2" width="1" begin="2" end="2" resetval="0x0" description="Event #2" range="2" rwaccess="WO"/> 
		<bitfield id="E1" width="1" begin="1" end="1" resetval="0x0" description="Event #1" range="1" rwaccess="WO"/> 
		<bitfield id="E0" width="1" begin="0" end="0" resetval="0x0" description="Event #0" range="0" rwaccess="WO"/>
	</register>
	<register id="TPCC0_QSER_RN" acronym="TPCC0_QSER_RN" offset="0x2090" width="32" description="">
		<bitfield id="RES81" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="E7" width="1" begin="7" end="7" resetval="0x0" description="Event #7" range="7" rwaccess="RO"/> 
		<bitfield id="E6" width="1" begin="6" end="6" resetval="0x0" description="Event #6" range="6" rwaccess="RO"/> 
		<bitfield id="E5" width="1" begin="5" end="5" resetval="0x0" description="Event #5" range="5" rwaccess="RO"/> 
		<bitfield id="E4" width="1" begin="4" end="4" resetval="0x0" description="Event #4" range="4" rwaccess="RO"/> 
		<bitfield id="E3" width="1" begin="3" end="3" resetval="0x0" description="Event #3" range="3" rwaccess="RO"/> 
		<bitfield id="E2" width="1" begin="2" end="2" resetval="0x0" description="Event #2" range="2" rwaccess="RO"/> 
		<bitfield id="E1" width="1" begin="1" end="1" resetval="0x0" description="Event #1" range="1" rwaccess="RO"/> 
		<bitfield id="E0" width="1" begin="0" end="0" resetval="0x0" description="Event #0" range="0" rwaccess="RO"/>
	</register>
	<register id="TPCC0_QSECR_RN" acronym="TPCC0_QSECR_RN" offset="0x2094" width="32" description="">
		<bitfield id="RES82" width="24" begin="31" end="8" resetval="0x0" description="RESERVE FIELD" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="E7" width="1" begin="7" end="7" resetval="0x0" description="Event #7" range="7" rwaccess="WO"/> 
		<bitfield id="E6" width="1" begin="6" end="6" resetval="0x0" description="Event #6" range="6" rwaccess="WO"/> 
		<bitfield id="E5" width="1" begin="5" end="5" resetval="0x0" description="Event #5" range="5" rwaccess="WO"/> 
		<bitfield id="E4" width="1" begin="4" end="4" resetval="0x0" description="Event #4" range="4" rwaccess="WO"/> 
		<bitfield id="E3" width="1" begin="3" end="3" resetval="0x0" description="Event #3" range="3" rwaccess="WO"/> 
		<bitfield id="E2" width="1" begin="2" end="2" resetval="0x0" description="Event #2" range="2" rwaccess="WO"/> 
		<bitfield id="E1" width="1" begin="1" end="1" resetval="0x0" description="Event #1" range="1" rwaccess="WO"/> 
		<bitfield id="E0" width="1" begin="0" end="0" resetval="0x0" description="Event #0" range="0" rwaccess="WO"/>
	</register>
	<register id="TPCC0_OPT" acronym="TPCC0_OPT" offset="0x4000" width="32" description="">
		<bitfield id="PRIV" width="1" begin="31" end="31" resetval="0x0" description="Privilege level:  privilege level (supervisor vs. user) for  the host/cpu/dma that programmed this PaRAM Entry. Value is  set with the vbus priv value when any part of the PaRAM  Entry is written. Not writeable via vbus wdata bus. Is  readable via VBus rdata bus.  PRIV = 0 : User level  privilege PRIV = 1 : Supervisor level privilege" range="31" rwaccess="RO"/> 
		<bitfield id="RES83" width="3" begin="30" end="28" resetval="0x0" description="RESERVE FIELD" range="30 - 28" rwaccess="RO"/> 
		<bitfield id="PRIVID" width="4" begin="27" end="24" resetval="0x0" description="Privilege ID:  Privilege ID for the external host/cpu/dma  that programmed this PaRAM Entry. This value is set with the  vbus privid value when any part of the PaRAM Entry is  written. Not writeable via vbus wdata bus. Is readable via  VBus rdata bus." range="27 - 24" rwaccess="RO"/> 
		<bitfield id="ITCCHEN" width="1" begin="23" end="23" resetval="0x0" description="Intermediate transfer completion chaining enable:  0:  Intermediate transfer complete chaining is disabled. 1:  Intermediate transfer complete chaining is enabled." range="23" rwaccess="RW"/> 
		<bitfield id="TCCHEN" width="1" begin="22" end="22" resetval="0x0" description="Transfer complete chaining enable:  0: Transfer complete  chaining is disabled. 1: Transfer complete chaining is  enabled." range="22" rwaccess="RW"/> 
		<bitfield id="ITCINTEN" width="1" begin="21" end="21" resetval="0x0" description="Intermediate transfer completion interrupt enable:  0:  Intermediate transfer complete interrupt is disabled. 1:  Intermediate transfer complete interrupt is enabled  (corresponding IER[TCC] bit must be set to 1 to generate  interrupt)" range="21" rwaccess="RW"/> 
		<bitfield id="TCINTEN" width="1" begin="20" end="20" resetval="0x0" description="Transfer complete interrupt enable:  0: Transfer complete  interrupt is disabled. 1: Transfer complete interrupt is  enabled (corresponding IER[TCC] bit must be set to 1 to  generate interrupt)" range="20" rwaccess="RW"/> 
		<bitfield id="WIMODE" width="1" begin="19" end="19" resetval="0x0" description="Backward compatibility mode:  0: Normal operation 1 : WI  Backwards Compatibility mode forces BCNT to be adjusted by  '1' upon TR submission (0 means 1 1 means 2 ... ) and  forces ACNT to be treated as a word-count (left shifted by 2  by hardware to create byte cnt for TR submission)" range="19" rwaccess="RW"/> 
		<bitfield id="RES84" width="1" begin="18" end="18" resetval="0x0" description="RESERVE FIELD" range="18" rwaccess="RO"/> 
		<bitfield id="TCC" width="6" begin="17" end="12" resetval="0x0" description="Transfer Complete Code:  The 6-bit code is used to set the  relevant bit in CER (bit CER[TCC]) for chaining or in IER  (bit IER[TCC]) for interrupts." range="17 - 12" rwaccess="RW"/> 
		<bitfield id="TCCMODE" width="1" begin="11" end="11" resetval="0x0" description="Transfer complete code mode:  Indicates the point at which a  transfer is considered completed. Applies to both chaining  and interrupt.  0: Normal Completion A transfer is  considered completed after the transfer parameters are  returned to the CC from the TC (which was returned from the  peripheral). 1: Early Completion A transfer is considered  completed after the CC submits a TR to the TC. CC generates  completion code internally ." range="11" rwaccess="RW"/> 
		<bitfield id="FWID" width="3" begin="10" end="8" resetval="0x0" description="FIFO width:  Applies if either SAM or DAM is set to FIFO  mode. Pass-thru to TC." range="10 - 8" rwaccess="RW"/> 
		<bitfield id="RES85" width="4" begin="7" end="4" resetval="0x0" description="RESERVE FIELD" range="7 - 4" rwaccess="RO"/> 
		<bitfield id="STATIC" width="1" begin="3" end="3" resetval="0x0" description="Static Entry:  0: Entry is updated as normal 1: Entry is  static Count and Address updates are not updated after TRP  is submitted. Linking is not performed." range="3" rwaccess="RW"/> 
		<bitfield id="SYNCDIM" width="1" begin="2" end="2" resetval="0x0" description="Transfer Synchronization Dimension:  0: A-Sync Each event  triggers the transfer of ACNT elements. 1: AB-Sync Each  event triggers the transfer of BCNT arrays of ACNT elements" range="2" rwaccess="RW"/> 
		<bitfield id="DAM" width="1" begin="1" end="1" resetval="0x0" description="Destination Address Mode:  Destination Address Mode within  an array. Pass-thru to TC.  0: INCR Dst addressing within  an array increments. Dst is not a FIFO. 1: FIFO Dst  addressing within an array wraps around upon reaching FIFO  width." range="1" rwaccess="RW"/> 
		<bitfield id="SAM" width="1" begin="0" end="0" resetval="0x0" description="Source Address Mode:  Source Address Mode within an array.  Pass-thru to TC.  0: INCR Src addressing within an array  increments. Source is not a FIFO. 1: FIFO Src addressing  within an array wraps around upon reaching FIFO width." range="0" rwaccess="RW"/>
	</register>
	<register id="TPCC0_SRC" acronym="TPCC0_SRC" offset="0x4004" width="32" description="">
		<bitfield id="SRC" width="32" begin="31" end="0" resetval="0x0" description="Source Address:  The 32-bit source address parameters  specify the starting byte address of the source . If SAM is  set to FIFO mode then the user should program the Source  address to be aligned to the value specified by the OPT.FWID  field. No errors are recognized here but TC will assert  error if this is not true." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="TPCC0_ABCNT" acronym="TPCC0_ABCNT" offset="0x4008" width="32" description="">
		<bitfield id="BCNT" width="16" begin="31" end="16" resetval="0x0" description="BCNT : Count for 2nd Dimension:  BCNT is a 16-bit unsigned  value that specifies the number of arrays of length ACNT.  For normal operation valid values for BCNT can be anywhere  between 1 and 65535. Therefore the maximum number of arrays  in a frame is 65535 (64K-1 arrays). BCNT=1 means 1 array in  the frame and BCNT=0 means 0 arrays in the frame.   In  normal mode a BCNT of '0' is considered as either a Null or  Dummy transfer. A Dummy or Null transfer will generate a  Completion code depending on the settings of the completion  bit fields of the OPT field.   If the OPT.WIMODE bit is set  then the programmed BCNT value will be incremented by '1'  before submission to TC. I.e. 0 means 1 1 means 2 2 means  3 ..." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="ACNT" width="16" begin="15" end="0" resetval="0x0" description="ACNT : number of bytes in 1st dimension:  ACNT represents  the number of bytes within the first dimension of a  transfer. ACNT is a 16-bit unsigned value with valid values  between 0 and 65535. Therefore the maximum number of bytes  in an array is 65535 bytes (64K-1 bytes). ACNT must be  greater than or equal to '1' for a TR to be submitted to TC.  An ACNT of '0' is considered as either a null or dummy  transfer. A Dummy or Null transfer will generate a  Completion code depending on the settings of the completion  bit fields of the OPT field.  If the OPT.WIMODE bit is set  then the ACNT field represents a word count. The CC must  internally multiply by 4 to translate the word count to a  byte count prior to submission to the TC. The 2 MSBs of the  16-bit ACNT are reserved and should always be written as  'b00 by the user. If user writes a value other than 0 it  will still be treated as 0 since the multiply-by-4 operation  (to translate between a word count and a byte count) will  dropthe 2 msbits. For dummy and null transfer definition  the ACNT definition will disregard the 2 msbits. I.e. a  programmed ACNT value of 0x8000 in WI-mode will be treated  as 0 byte transfer resulting in null or dummy operation  dependent on the state of BCNT and CCNT." range="15 - 0" rwaccess="RW"/>
	</register>
