IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TPCC0_TPCC0.xml
	<register id="TPCC0_DST" acronym="TPCC0_DST" offset="0x400C" width="32" description="">
		<bitfield id="DST" width="32" begin="31" end="0" resetval="0x0" description="Destination Address:  The 32-bit destination address  parameters specify the starting byte address of the  destination. If DAM is set to FIFO mode then the user should  program the Destination address to be aligned to the value  specified by the OPT.FWID field. No errors are recognized  here but TC will assert error if this is not true." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="TPCC0_BIDX" acronym="TPCC0_BIDX" offset="0x4010" width="32" description="">
		<bitfield id="DBIDX" width="16" begin="31" end="16" resetval="0x0" description="Destination 2nd Dimension Index:  DBIDX is a 16-bit signed  value (2's complement) used for destination address  modification in between each array in the 2nd dimension. It  is a signed value between -32768 and 32767. It provides a  byte address offset from the beginning of the destination  array to the beginning of the next destination array within  the current frame. It applies to both A-Sync and AB-Sync  transfers." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SBIDX" width="16" begin="15" end="0" resetval="0x0" description="Source 2nd Dimension Index:  SBIDX is a 16-bit signed value  (2's complement) used for source address modification in  between each array in the 2nd dimension. It is a signed  value between -32768 and 32767. It provides a byte address  offset from the beginning of the source array to the  beginning of the next source array. It applies to both  A-sync and AB-sync transfers." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="TPCC0_LNK" acronym="TPCC0_LNK" offset="0x4014" width="32" description="">
		<bitfield id="BCNTRLD" width="16" begin="31" end="16" resetval="0x0" description="BCNT Reload:  BCNTRLD is a 16-bit unsigned value used to  reload the BCNT field once the last array in the 2nd  dimension is transferred. This field is only used for  A-Sync'ed transfers. In this case the CC decrements the  BCNT value by one on each TR submission. When BCNT  (conceptually) reaches zero then the CC decrements CCNT and  uses the BCNTRLD value to reinitialize the BCNT value. For  AB-synchronized transfers the CC submits the BCNT in the TR  and therefore the TC is responsible to keep track of BCNT  not thus BCNTRLD is a don't care field." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="LINK" width="16" begin="15" end="0" resetval="0x0" description="Link Address:  The CC provides a mechanism to reload the  current PaRAM Entry upon its natural termination (i.e.  after count fields are decremented to '0') with a new PaRAM  Entry. This is called 'linking'. The 16-bit parameter LINK  specifies the byte address offset in the PaRAM from which  the CC loads/reloads the next PaRAM entry in the link. The  CC should disregard the value in the upper 2 bits of the  LINK field as well as the lower 5-bits of the LINK field.  The upper two bits are ignored such that the user can  program either the 'literal' byte address of the LINK  parameter or the 'PaRAM base-relative' address of the link  field. Therefore if the user uses the literal address with  a range from 0x4000 to 0x7FFF it will be treated as a  PaRAM-base-relative value of 0x0000 to 0x3FFF. The lower-5  bits are ignored and treated as 'b00000 thereby  guaranteeing that all Link pointers point to a 32-byte  aligned PaRAM entry. In the latter case (5-lsbs) behavior  is undefined forthe user (i.e. don't have to test it). In  the former case (2 msbs) user should be able to take  advantage of this feature (i.e. do have to test it). If a  Link Update is requested to a PaRAM address that is beyond  the actual range of implemented PaRAM then the Link will be  treated as a Null Linkand all 0s plus 0xFFFF will be written  to the current entry location.   A LINK value of 0xFFFF is  referred to as a NULL link which should cause the CC to  write 0x0 to all entries of the current PaRAM Entry except  for the LINK field which is set to 0xFFFF. The  Priv/Privid/Secure state is overwritten to 0x0 when linking.  MSBs and LSBS should not be masked when comparing against  the 0xFFFF value. I.e. a value of 0x3FFE is a non-NULL  PaRAM link field." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="TPCC0_CIDX" acronym="TPCC0_CIDX" offset="0x4018" width="32" description="">
		<bitfield id="DCIDX" width="16" begin="31" end="16" resetval="0x0" description="Destination Frame Index:  DCIDX is a 16-bit signed value  (2's complement) used for destination address modification  for the 3rd dimension. It is a signed value between -32768  and 32767. It provides a byte address offset from the  beginning of the current array (pointed to by DST address)  to the beginning of the first destination array in the next  frame. It applies to both A-sync and AB-sync transfers. Note  that when DCIDX is applied the current array in an A-sync  transfer is the last array in the frame while the current  array in a ABsync transfer is the first array in the frame." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SCIDX" width="16" begin="15" end="0" resetval="0x0" description="Source Frame Index:  SCIDX is a 16-bit signed value (2's  complement) used for source address modification for the 3rd  dimension. It is a signed value between -32768 and 32767. It  provides a byte address offset from the beginning of the  current array (pointed to by SRC address) to the beginning  of the first source array in the next frame. It applies to  both A-sync and AB-sync transfers. Note that when SCIDX is  applied the current array in an A-sync transfer is the last  array in the frame while the current array in a AB-sync  transfer is the first array in the frame." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="TPCC0_CCNT" acronym="TPCC0_CCNT" offset="0x401C" width="32" description="">
		<bitfield id="RES86" width="16" begin="31" end="16" resetval="0x0" description="RESERVE FIELD" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="CCNT" width="16" begin="15" end="0" resetval="0x0" description="CCNT : Count for 3rd Dimension:  CCNT is a 16-bit unsigned  value that specifies the number of frames in a block. Valid  values for CCNT can be anywhere between 1 and 65535.  Therefore the maximum number of frames in a block is 65535  (64K-1 frames). CCNT of '1' means '1' frame in the block  and CCNT of '0' means '0' frames in the block. A CCNT value  of '0' is considered as either a null or dummy transfer. A  Dummy or Null transfer will generate a Completion code  depending on the settings of the completion bit fields of  the OPT field.   WIMODE has no affect on CCNT operation." range="15 - 0" rwaccess="RW"/>
	</register>
</module>